[
  {
    "id": "CS 7",
    "title": "Personal Finance for Engineers",
    "description": "Introduction to the fundamentals and analysis specifically needed by engineers to make informed and intelligent financial decisions. Course will focus on actual industry-based financial information from technology companies and realistic financial issues. Topics include: behavioral finance, budgeting, debt, compensation, stock options, investing and real estate. No prior finance or economics experience required.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Nash, A. (PI)"
    ]
  },
  {
    "id": "CS 10N",
    "title": "Computer Play: An Unconventional Introduction to CS and EE",
    "description": "Experimental introduction to computer science and electrical engineering. Students will learn to create interactive programs that understand sounds made by real-world musical instruments and the big ideas behind some of the core discoveries, surprises, and impossibilities at the core of CS and EE.",
    "terms": [
      "Spr"
    ],
    "units": "4",
    "instructors": [
      "Winstein, K. (PI)"
    ]
  },
  {
    "id": "CS 11SI",
    "title": "How to Make VR: Introduction to Virtual Reality Design and Development",
    "description": "In this hands-on, experiential course, students will design and develop virtual reality applications. You'll learn how to use the Unity game engine, the most popular platform for creating immersive applications. The class will teach the design best practices and the creation pipeline for VR applications. Students will work in groups to present a final project in building an application for the Oculus Quest 2 headset. Enrollment is limited and by application only. See https://cs11si.stanford.edu for more information and the link to the application. Prerequisite: CS 106A or equivalent",
    "terms": [
      "Win"
    ],
    "units": "2",
    "instructors": [
      "Borenstein, J. (PI)"
    ]
  },
  {
    "id": "CS 21SI",
    "title": "AI for Social Good",
    "description": "Students will explore challenging social issues, and learn about the opportunities and limitations for AI to empower human solutions! You'll learn about applying AI to real-world social good spaces (such as climate, education, and housing) and learn what this looks like in practice. The class provides a high-level overview of the machine learning and deep learning techniques that have already proven effective in tackling social problems. Overall, we aim to center the \"social good\" component of AI for Social Good and cover material you would not otherwise see in the AI curriculum at Stanford. The course structure alternates between instructional lectures and bi-weekly guest speakers at the forefront of technology for social good. Students will be given the chance to engage in a flexible combination of AI model building, discussion, and individual exploration. Special topics may include: tech ethics, human-centered AI, AI safety, education technology, mental health applications, AI in policy, assistive robotics. Prerequisites: programming experience at the level of CS106A and an interest in social impact! Application required for enrollment: http://tinyurl.com/cs21si2425. We encourage students from all disciplines and backgrounds to apply!",
    "terms": [
      "Spr"
    ],
    "units": "2",
    "instructors": [
      "Piech, C. (PI)"
    ]
  },
  {
    "id": "CS 22A",
    "title": "The Social & Economic Impact of Artificial Intelligence (INTLPOL 200, SYMSYS 122)",
    "description": "Recent advances in Generative AI are rapidly transforming how we live and work. This lecture course offers a non-technical exploration of its foundational principles, inherent strengths and limitations, and a comprehensive overview of its profound impact on our society and economy. We will delve into critical questions: How will AI reshape labor markets and jobs? What roles will it play in medical research, healthcare, education, entertainment, engineering, transportation, and the legal system? How will it be used - or misused - in democratic societies and autocratic regimes? Will it alter the geopolitical balance of power and the nature of warfare? How can we align these powerful systems with human values? Can machines genuinely create, or possess consciousness? Does the prospect of superintelligence mean the human race is doomed? Will the benefits of this technological revolution be broadly distributed, or accrue to a lucky few? Are we currently experiencing an 'AI bubble'? This course also demystifies essential jargon, such as 'transformers', 'prompt engineering', 'chain of thought', 'hallucination', 'jailbreaking', 'context rot', 'deepfakes', 'stochastic parrots', and 'algorithmic bias'. By equipping students with historical grounding, intellectual tools, ethical frameworks, and psychological perspectives, this course prepares them to thoughtfully navigate the complexities of the AI revolution. (Note: This course is pre-approved for credit at Stanford Law School (SLS) and the Graduate School of Business (GSB). GSB students must enroll in either SYMSYS 122 or INTLPOL 200 for GSB credit. No programming or prior technical knowledge is required.)",
    "terms": [
      "Win"
    ],
    "units": "1",
    "instructors": [
      "Kaplan, J. (PI)"
    ]
  },
  {
    "id": "CS 24",
    "title": "Minds and Machines (LINGUIST 35, PHIL 99, PSYCH 35, SYMSYS 1, SYMSYS 200)",
    "description": "(Formerly SYMSYS 100). An overview of the interdisciplinary study of cognition, information, communication, and language, with an emphasis on foundational issues: What are minds? What is computation? What are rationality and intelligence? Can we predict human behavior? Can computers be truly intelligent? How do people and technology interact, and how might they do so in the future? Lectures focus on how the methods of philosophy, mathematics, empirical research, and computational modeling are used to study minds and machines. Students must take this course before being approved to declare Symbolic Systems as a major. All students interested in studying Symbolic Systems are urged to take this course early in their student careers. The course material and presentation will be at an introductory level, without prerequisites. Note that this is a hybrid course. Students should plan to enroll by the first day of the quarter and check their Stanford email account for instructions on how to access the course material. If you have any questions about the course, please email symsys1staff@gmail.com.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "4",
    "instructors": [
      "Frank, M. (PI)",
      "Goodman, N. (PI)",
      "Krejci, B. (PI)",
      "Wu, J. (PI)"
    ]
  },
  {
    "id": "CS 25N",
    "title": "Big Ideas in Cryptography",
    "description": "Cryptography - securing data in the presence of an adversary - has been practiced for thousands of years. Today, cryptography is more ubiquitous than ever, as it is the foundation underlying our secure digital world. Modern cryptography is also characterized by surprising solutions to seemingly impossible tasks. In this seminar, we will survey some of the big ideas in cryptography, including cryptanalysis (including breaking the Enigma during WWII), methodologies behind the design of secure ciphers, public key cryptography (securely exchanging messages without ever having met in person to share a secret key), zero knowledge proofs (proving statements without revealing the proof), homomorphic encryption (performing computations on encrypted data), cryptocurrencies, and more. Prerequisites: Basic programming knowledge and mathematical maturity suggested.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Zhandry, M. (PI)"
    ]
  },
  {
    "id": "CS 31N",
    "title": "Counterfactuals: The Science of What Ifs?",
    "description": "How might the past have changed if different decisions were made? This question has captured the fascination of people for hundreds of years. By precisely asking, and answering such questions of counterfactual inference, we have the opportunity to both understand the impact of past decisions (has climate change worsened economic inequality?) and inform future choices (can we use historical electronic medical records data about decision made and outcomes, to create better protocols to enhance patient health?). In this course I will introduce some of the most common quantitative approaches to counterfactual reasoning, as well as give a wide sampling of some of the many important problems and questions that can be addressed through the lens of counterfactual reasoning, including in climate change, healthcare and economics. No prior experience with counterfactual or \"what if\" reasoning, nor probability, is required.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Brunskill, E. (PI)"
    ]
  },
  {
    "id": "CS 42SI",
    "title": "From Player to Maker:  2D Engine-Based Game Development",
    "description": "This course aims to get students experienced with the game development lifecycle, developing multiple game projects from start to finish. Students will utilize various ideation tools for brainstorming (borrowed from the Design program), use the Unity Engine to develop 2D games in individual and collaborative settings, and publish their work on live websites by entering into friendly competitions known as \"game jams\". By the end of the quarter, students will have created three rapid-prototype games and gained the proper skills to make games on their own. Prerequisites: This course uses the Unity Engine, which uses the C# programming language. Because of this, you should be familiar with programming at the level of CS106A or the AP Computer Science exam.",
    "terms": [
      "Aut"
    ],
    "units": "2",
    "instructors": [
      "Borenstein, J. (PI)",
      "Wang, L. (GP)"
    ]
  },
  {
    "id": "CS 44N",
    "title": "Great Ideas in Graphics",
    "description": "A hands-on interactive and fun exploration of great ideas from computer graphics. Motivated by graphics concepts, mathematical foundations and computer algorithms, students will explore an eccentric selection of \"great ideas\" through short weekly programming projects. Project topics will be selected from a diverse array of computer graphics concepts and historical elements.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "James, D. (PI)"
    ]
  },
  {
    "id": "CS 47N",
    "title": "Datathletics: Diving into Data Analytics and Stanford Sports",
    "description": "Sophisticated data collection and analysis are now key to program success across many sports: Nearly all professional and national-level teams employ data scientists, and \"datathletics\" is becoming prevalent in college sports as well. This immersive seminar combines extensive hands-on data analytics with a first-hand peek into Stanford athletics. Class meetings roughly alternate between: (1) instruction in a variety of tools and techniques for analyzing and visualizing data; and (2) guest lectures by Stanford athletics coaches explaining how data is or could be used in their sport. Through regular problem sets, students bring each week's tools to bear on data related to the week's sport. One goal of the class is empowering students to perform compelling data analytics by mastering tools across a wide spectrum, including spreadsheets, the Tableau system for data preparation and visualization, Jupyter notebooks, relational databases and SQL, Python and many of its data-specific packages including Pandas, and machine learning. On the sports side, while the Stanford coaches may touch on many aspects of data collection and analysis, the main focus of this course is on using data for strategic decision-making rather than optimizing individual human performance. Prerequisites: No background in statistics or data analysis is needed, but basic programming and computing skills at the level of high school computer science or CS106A is expected. On the flip side, students with extensive experience in coding or data science may not be challenged by the technical aspects of the course.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Widom, J. (PI)"
    ]
  },
  {
    "id": "CS 51",
    "title": "CS + Social Good Studio: Designing Social Impact Projects",
    "description": "Get real-world experience researching and developing your own social impact project! Students in CS51 work in small teams to develop high-impact projects around problem domains provided by partner organizations, under the guidance and support of design/technical coaches from industry and non-profit domain experts. Main class components are workshops, team collaboration, guest speakers and mentorship. Studio provides an outlet for students to create social change through CS while engaging in the full product development cycle on real-world projects. The class culminates in a showcase where students share their project ideas and Minimum Viable Product (MVP) prototypes with stakeholders and the public. Application required; please see cs51.stanford.edu for more information. Designated a Cardinal Course by the Haas Center for Public Service.",
    "terms": [
      "Win"
    ],
    "units": "2",
    "instructors": [
      "Cain, J. (PI)"
    ]
  },
  {
    "id": "CS 52",
    "title": "CS + Social Good Studio: Implementing Social Good Projects",
    "description": "CS52 is a required continuation of CS51 (CS + Social Good Studio). Teams enter the quarter having completed and tested a MVP with a well-defined target user, and a community partner. Students will learn to apply scalable technical frameworks, tools for deployment, and user testing techniques. The purpose of the class is to facilitate students to build a sustainable infrastructure around their product idea. Main class components are workshops, team collaboration, and software development. The class culminates in a showcase where students share their projects with stakeholders and the public.",
    "terms": [
      "Spr"
    ],
    "units": "2",
    "instructors": [
      "Cain, J. (PI)"
    ]
  },
  {
    "id": "CS 53N",
    "title": "How Can Generative AI Help Us Learn? (DESIGN 183N)",
    "description": "This seminar course will explore the science behind generative AI, the likely future of tools such as DALL-E, ChatGPT, GPT-4, and Bard, and the implications for education, both in and outside of structured school environments. Students in the course will work in teams to each become experts in some aspect of AI and in some way that generative AI could create a new future for education. The background for this course is the public release of ChatGPT, which created new awareness of the potential power of AI to dramatically change our lives. In considering the possible implications for education, ChatGPT has sparked dreams of automated personal tutors, customizable teaching assistance, AI-led collaborative learning, and revolutions in assessment. In addition to optimistic projections, there are clear and significant risks. For example, will AI-assisted learning be culturally appropriate and equally available to all? Can it increase opportunity for underprivileged learners worldwide, or will it accentuate privilege and privileged views?  Will it help us learn faster, or distract us from thinking deeply about difficult problems ourselves? As experienced student learners, members of the class will be able to draw on their own educational history and design learning approaches that could change the future of their education and others in college or at other stages of their lives.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Mitchell, J. (PI)"
    ]
  },
  {
    "id": "CS 80E",
    "title": "Dissecting The Modern Computer",
    "description": "In this course, students will be given a high-level, accessible introduction to computer architecture through the use of the RISC-V ISA. Through a series of interactive units, students will learn about the inner-workings of computers, from the execution of our programs all the way down to the hardware that runs them. Topics include simple digital circuits, assembly, simple processors, memory systems (Cache, DRAM, Disk), and bonus topics like GPU's. After completing this class, students should have a newfound appreciation for how incredible computational technology is, as well as direction to fantastic classes that delve into some of these topics in more detail, like CS149, EE108, and EE180. Prerequisite: CS106B.",
    "terms": [
      "Aut"
    ],
    "units": "2",
    "instructors": [
      "Master, T. (PI)"
    ]
  },
  {
    "id": "CS 83N",
    "title": "Playback Theater",
    "description": "Playback combines elements of theater, community work and storytelling. In a playback show, a group of actors and musicians create an improvised performance based on the audience's personal stories. A playback show brings about a powerful listening and sharing experience. During the course, we will tell, listen, play together, and train in playback techniques. We will write diaries to process our experience in the context of education and research.  The course is aimed to strengthen listening abilities, creativity and the collaborative spirit, all integral parts of doing great science. In playback, as in research, we are always moving together, from the known, to the unknown, and back. There is limited enrollment for this class. Application is required.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Reingold, O. (PI)"
    ]
  },
  {
    "id": "CS 100ACE",
    "title": "Problem-solving Lab for CS106A",
    "description": "Additional problem solving practice for the introductory CS course CS 106A. Sections are designed to allow students to acquire a deeper understanding of CS and its applications, work collaboratively, and develop a mastery of the material. Limited enrollment, permission of instructor required. Concurrent enrollment in CS 106A required.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Ebssa, E. (PI)"
    ]
  },
  {
    "id": "CS 100BACE",
    "title": "Problem-solving Lab for CS106B",
    "description": "Additional problem solving practice for the introductory CS course CS106B. Sections are designed to allow students to acquire a deeper understanding of CS and its applications, work collaboratively, and develop a mastery of the material. Limited enrollment, permission of instructor required. Concurrent enrollment in CS 106B required.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Holm, E. (PI)",
      "Jeong, K. (PI)"
    ]
  },
  {
    "id": "CS 103",
    "title": "Mathematical Foundations of Computing",
    "description": "What are the theoretical limits of computing power? What problems can be solved with computers? Which ones cannot? And how can we reason about the answers to these questions with mathematical certainty? This course explores the answers to these questions and serves as an introduction to discrete mathematics, computability theory, and complexity theory. At the completion of the course, students will feel comfortable writing mathematical proofs, reasoning about discrete structures, reading and writing statements in first-order logic, and working with mathematical models of computing devices. Throughout the course, students will gain exposure to some of the most exciting mathematical and philosophical ideas of the late nineteenth and twentieth centuries. Specific topics covered include formal mathematical proofwriting, propositional and first-order logic, set theory, binary relations, functions (injections, surjections, and bijections), cardinality, basic graph theory, the pigeonhole principle, mathematical induction, finite automata, regular expressions, the Myhill-Nerode theorem, context-free grammars, Turing machines, decidable and recognizable languages, self-reference and undecidability, verifiers, and the P versus NP question. Students with significant proofwriting experience are encouraged to instead take CS154. Students interested in extra practice and support with the course are encouraged to concurrently enroll in CS103A. Prerequisite: CS106B or equivalent. CS106B may be taken concurrently with CS103.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Aiken, A. (PI)",
      "Bailey, C. (PI)",
      "Schwarz, K. (PI)",
      "Szumlanski, S. (PI)",
      "Barbella-Blaha, A. (TA)",
      "Bliss, E. (TA)",
      "Dalmia, T. (TA)",
      "Hekmat, H. (TA)",
      "Li, A. (TA)",
      "Li, K. (TA)",
      "Ma, K. (TA)",
      "Tariq, U. (TA)"
    ]
  },
  {
    "id": "CS 103ACE",
    "title": "Mathematical Problem-solving Strategies",
    "description": "Problem solving strategies and techniques in discrete mathematics and computer science. Additional problem solving practice for CS103. In-class participation required. Prerequisite: consent of instructor. Co-requisite: CS103.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Yee, E. (PI)",
      "Schwarz, K. (GP)",
      "Szumlanski, S. (GP)"
    ]
  },
  {
    "id": "CS 104",
    "title": "Introduction to Essential Software Systems and Tools",
    "description": "Concepts that are prerequisites to many different CS classes, such as version control, debugging, and basic cryptography and networking, are either left for students to figure out on their own or are taught in \"crash course\" form on-the-fly during other, unrelated classes. We propose to develop a course that will teach students the skills necessary to be successful computer scientists, such as the command line, source code management and debugging, security and cryptography, containers and virtual machines, and cloud computing. In this course, students will both become proficient with practical tools and develop a deeper, intuitive understanding of the involved software systems and computer science concepts. With this deeper understanding, students can leverage critical thinking skills to intelligently and efficiently configure and troubleshoot software systems, assess the security and efficiency of particular tool usages, and synthesize new automation pipelines that integrate multiple tools. To summarize, instead of having just a cursory understanding of how to use these tools, students will learn how to most effectively use these tools to become proficient programmers and computer scientists. In addition, this course can provide a gentle introduction to potentially challenging computer science concepts (e.g., networking) that become a focus in subsequent courses and also help motivate some of the tool usages they will see later in the degree program.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Achour, S. (PI)"
    ]
  },
  {
    "id": "CS 105",
    "title": "Introduction to Computers",
    "description": "For non-technical majors. What computers are and how they work. Practical experience in development of websites and an introduction to programming.  A survey of Internet technology and the basics of computer hardware. Students in technical fields and students looking to acquire programming skills should take 106A or 106X. Students with prior computer science experience at the level of 106 or above require consent of instructor. Prerequisite: minimal math skills.",
    "terms": [
      "Aut"
    ],
    "units": "3-5",
    "instructors": [
      "Fiden, P. (PI)",
      "Young, P. (PI)",
      "Atluri, A. (GP)",
      "Murakami, Y. (GP)"
    ]
  },
  {
    "id": "CS 106A",
    "title": "Programming Methodology",
    "description": "Introduction to the engineering of computer applications emphasizing modern software engineering principles: program design, decomposition, encapsulation, abstraction, and testing. Emphasis is on good programming style and the built-in facilities of respective languages. Uses the Python programming language.  No prior programming experience required.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Parlante, N. (PI)",
      "Sahami, M. (PI)"
    ]
  },
  {
    "id": "CS 106AX",
    "title": "Programming Methodologies in JavaScript and Python (Accelerated)",
    "description": "Introduction to the engineering of computer applications emphasizing modern software engineering principles: object-oriented design, decomposition, encapsulation, abstraction, and testing. This course targets an audience with prior programming experience, and that prior experience is leveraged so material can be covered in greater depth.",
    "terms": [
      "Aut"
    ],
    "units": "3-5",
    "instructors": [
      "Cain, J. (PI)",
      "Yan, B. (TA)"
    ]
  },
  {
    "id": "CS 106B",
    "title": "Programming Abstractions",
    "description": "Abstraction and its relation to programming. Software engineering principles of data abstraction and modularity. Object-oriented programming, fundamental data structures (such as stacks, queues, sets) and data-directed design. Recursion and recursive data structures (linked lists, trees, graphs). Introduction to time and space complexity analysis. Uses the programming language C++ covering its basic facilities. Prerequisite: 106A or equivalent.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Bailey, C. (PI)",
      "Gregg, C. (PI)",
      "Szumlanski, S. (PI)",
      "Alonso, Y. (GP)"
    ]
  },
  {
    "id": "CS 106E",
    "title": "Exploring Computing",
    "description": "This course, designed for the non-computer scientist, will provide students with a solid foundation in the concepts and terminology behind computers, the Internet, and software development. It will give you better understanding and insight when working with technology.  It will be particularly useful to future managers and PMs who will work with or who will lead programmers and other tech workers.  But it will be useful to anyone who wants a better understanding of tech concepts and terms.  We'll start by covering the foundations of Computer Hardware, the CPU, Operating Systems, Computer Networks, and the Web. We will then use our foundation to explore a variety of tech-related topics including Computer Security (how computers are attacked and defensive measures that can be taken); Cloud Computing, Artificial Intelligence, Software Development, Human-Computer Interaction, and Computer Theory.Prerequisites: Some programming experience at the High School level of above will help students get the most out of the class, but the course can be successfully completed with no prerequisites.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Young, P. (PI)"
    ]
  },
  {
    "id": "CS 106EA",
    "title": "Exploring Artificial Intelligence",
    "description": "CS106EA will provide students with an overview of Artificial Intelligence and understanding of key AI concepts.  We will examine a typical Machine Learning pipeline.  We'll study different problems that ML is used to solve and common issues that arise (such as overfitting, drift, and bias).  Students will learn how neural networks work and then examine specialized versions of neural networks for processing images, sequence data, and text.  We'll explore generative AI systems for text and images.  We'll also study societal issues related to Artificial Intelligence including ethical considerations and the implications of automation. This course will focus on providing a conceptual understanding of AI.  While students will get some hands-on time working with and modifying actual artificial intelligence systems, it is not a programming class.  However, students should have CS106A or comparable experience as we'll be assuming some basic understanding of programming.",
    "terms": [
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3",
    "instructors": [
      "Young, P. (PI)",
      "Atluri, A. (GP)",
      "Murakami, Y. (GP)"
    ]
  },
  {
    "id": "CS 106L",
    "title": "Standard C++ Programming Laboratory",
    "description": "This class explores features of the C++ programming language beyond what's covered in CS106B. Topics include core C++ language features (e.g. const-correctness, operator overloading, templates, move semantics, and lambda expressions) and standard libraries (e.g. containers, algorithms, and smart pointers). Pre- or corequisite: CS106B or equivalent. Prerequisite: CS106B or equivalent. CS106L may be taken concurrently with CS106B.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Gregg, C. (PI)",
      "Szumlanski, S. (PI)",
      "Fernandez, R. (GP)",
      "Poimenidis, T. (GP)"
    ]
  },
  {
    "id": "CS 106M",
    "title": "Enrichment Adventures in Programming Abstractions",
    "description": "This enrichment add-on is a companion course to CS106B to explore additional topics and go into further depth. Specific topics to be announced per-quarter; past topics have included search engines, pattern recognition, data compression/encryption, error correction, digital signatures, and numerical recipes.  Students must be co-enrolled in CS106B.  Refer to cs106m.stanford.edu for more information.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Zelenski, J. (PI)"
    ]
  },
  {
    "id": "CS 107",
    "title": "Computer Organization and Systems",
    "description": "Introduction to the fundamental concepts of computer systems. Explores how computer systems execute programs and manipulate data, working from the C programming language down to the microprocessor. Topics covered include: the C programming language, data representation, machine-level code, computer arithmetic, elements of code compilation, memory organization and management, and performance evaluation and optimization. Students may not earn credit for both CS 107 and CS 107E.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Cain, J. (PI)",
      "Troccoli, N. (PI)",
      "Aggarwal, A. (TA)",
      "Barrett, K. (TA)",
      "Devalapura, A. (TA)",
      "Ibanez, F. (TA)",
      "Rodriguez Cardenas, J. (TA)",
      "Toure, L. (TA)",
      "Vallabhaneni, H. (TA)"
    ]
  },
  {
    "id": "CS 107ACE",
    "title": "Problem-solving Lab for CS107",
    "description": "Additional problem solving practice for the introductory CS course CS107. Sections are designed to allow students to acquire a deeper understanding of CS and its applications, work collaboratively, and develop a mastery of the material. Limited enrollment, permission of instructor required. Concurrent enrollment in CS 107 required.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Berny, I. (PI)"
    ]
  },
  {
    "id": "CS 107E",
    "title": "Computer Systems from the Ground Up",
    "description": "Introduction to the fundamental concepts of computer systems through bare metal programming on the Raspberry Pi. Explores how five concepts come together in computer systems: hardware, architecture, assembly code, the C language, and software development tools. Students do all programming with a Raspberry Pi kit and several add-ons (LEDs, buttons). Topics covered include: the C programming language, data representation, machine-level code, computer arithmetic, compilation, memory organization and management, debugging, hardware, and I/O. Enrollment limited to 40. Check website for details: http://cs107e.stanford.edu on student selection process. Prerequisite: CS106B or CS106X, and consent of instructor. There is a $75 course lab fee. Students may not earn credit for both CS 107 and CS 107E.",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Zelenski, J. (PI)"
    ]
  },
  {
    "id": "CS 109",
    "title": "Introduction to Probability for Computer Scientists",
    "description": "Topics include: counting and combinatorics, random variables, conditional probability, independence, distributions, expectation, point estimation, and limit theorems. Applications of probability in computer science including machine learning and the use of probability in the analysis of algorithms.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Gregg, C. (PI)",
      "Piech, C. (PI)",
      "Woodrow, J. (PI)",
      "Bejerano, N. (TA)",
      "Bogle, E. (TA)",
      "Choo, J. (TA)",
      "Fisher Lopez, A. (TA)",
      "Kim, J. (TA)",
      "Kim, T. (TA)",
      "Michel, I. (TA)",
      "Sundar, S. (TA)",
      "Woodrow, J. (TA)",
      "Xu, B. (TA)",
      "Zhu, E. (TA)"
    ]
  },
  {
    "id": "CS 109ACE",
    "title": "Problem-solving Lab for CS109",
    "description": "Additional problem solving practice for the introductory CS course CS109. Sections are designed to allow students to acquire a deeper understanding of CS and its applications, work collaboratively, and develop a mastery of the material. Enrollment limited to 30 students, permission of instructor required. Concurrent enrollment in CS 109 required.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Arifov, J. (PI)"
    ]
  },
  {
    "id": "CS 111",
    "title": "Operating Systems Principles",
    "description": "Explores operating system concepts including concurrency, synchronization, scheduling, processes, virtual memory, I/O, file systems, and protection. Available as a substitute for CS110 that fulfills any requirement satisfied by CS110. Prerequisite: CS107.",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Rosenblum, M. (PI)",
      "Troccoli, N. (PI)"
    ]
  },
  {
    "id": "CS 111ACE",
    "title": "Problem Solving Lab for CS111",
    "description": "Additional design and implementation problems to complement the material taught in CS111. In-class participation is required. Prerequisite: consent of instructor. Corequisite: CS111",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Ibanez, F. (PI)"
    ]
  },
  {
    "id": "CS 112",
    "title": "Operating systems kernel implementation project",
    "description": "Students will learn the details of how operating systems work throughfour implementation projects in the Pintos operating system.  Theprojects center around threads, processes, virtual memory, and filesystems.  This class should not be taken by students who have taken orplan to take CS212 or CS140.  Prerequisite: CS111 or permission of theinstructor.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Mazieres, D. (PI)"
    ]
  },
  {
    "id": "CS 120",
    "title": "Introduction to AI Safety",
    "description": "What is safe AI, and how do we make it? CS120 explores this question, focusing on the technical challenges of creating reliable, ethical, and aligned AI systems. We distinguish between model-specific and systemic safety issues, from examining fairness and data limitations to adversarial vulnerabilities and embedding desired behavior in AI. While primarily focusing on current solutions and their limitations through CS publications, we will also discuss socio-technical concerns of modern AI deployment, how oversight of intelligence could look like, and what future risks we might face. Topics will span reinforcement learning, computer vision, and natural language processing, focusing on interpretability, robustness, and evaluations. You will gain insights into the complexities and problems of why ensuring AI safety and reliability is challenging through lectures, readings, quizzes, and a final project. This course aims to prepare you to critically assess and contribute to safe AI development, equipping them with knowledge of cutting-edge research and ongoing debates in the field. This course has no official requirements, although we recommend some knowledge about machine learning and statistics. For more details, see also the course website: https://web.stanford.edu/class/cs120/",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Lamparth, M. (PI)",
      "Pertseva, L. (TA)",
      "Solomon, N. (TA)"
    ]
  },
  {
    "id": "CS 121",
    "title": "Equity and Governance for Artificial Intelligence",
    "description": "This course invites students to argue about the consensus-building processes that shape the development and governance of AI systems. This course requires writing op-eds, policy memos, and research papers, in which students will critically engage AI policy documents while debating norms of fairness, accountability, and transparency. Students will also get hands-on practice evaluating generative AI models with interactive red-teaming and automated test suites (requires a small amount of coding in a group project). Students will engage real-world legislative proposals and case studies topics including human rights, artwork, the environment, and geopolitics. This course fulfills both the ethics and Writing in the Major WiM requirements, and is designed to prepare Stanford juniors, seniors, and graduate students to participate in AI public policy design at the national and global levels. Prerequisites: PWR1, PWR2, CS106A and CS106B. While this course requires no other prerequisites, it is designed for students who are comfortable engaging in an active learning environment that will include interactive workshops, student debates, and collaborative group projects. Students will be expected to speak frequently in sections and navigate the social dynamics of multi-stakeholder negotiations. Comfort with writing short python programs and working on a Unix/Linux command-line interface will be helpful for the AI model evaluation group project.",
    "terms": [
      "Aut"
    ],
    "units": "4",
    "instructors": [
      "Bailey, C. (PI)",
      "Bempong, A. (TA)"
    ]
  },
  {
    "id": "CS 123",
    "title": "A Hands-On Introduction to Building AI-Enabled Robots",
    "description": "This course offers a hands-on introduction to AI-powered robotics. Unlike most introductory robotics courses, students will learn essential robotics concepts by constructing a quadruped robot from scratch and training it to perform real-world tasks. The course covers a broad range of topics critical to robot learning, including motor control, forward and inverse kinematics, system identification, simulation, and reinforcement learning. Through weekly labs, students will construct a pair of tele-operated robot arms with haptic feedback, program a robot arm to learn self-movement, and ultimately create and program an agile robot quadruped named Pupper. In the final four weeks, students will undertake an open-ended project using Pupper as a platform, such as instructing it to walk using reinforcement learning, developing a vision system to allow Pupper to play fetch, or redesigning the hardware to enhance the robot's agility. Note: CS123 strives to achieve a balanced distribution of seniority across the undergrad student body. Within the first 100 registrations, enrollment of students will follow a lottery that balances such distribution amongst undergraduates. Please use the form below to enroll in the class. The form will be open on 9/8/2025 9:00AM Pacific Time. Please use this form to apply: https://tinyurl.com/cs123-2025fall and check out our website for more information: https://cs123-stanford.readthedocs.io/",
    "terms": [
      "Aut",
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Liu, K. (PI)",
      "Hu, J. (TA)"
    ]
  },
  {
    "id": "CS 124",
    "title": "From Languages to Information (LINGUIST 180, LINGUIST 280)",
    "description": "NLP for extracting meaning from text and social networks on the web, and interacting with people via language.  Introducing methods (from regex to large language models, via logistic regression, gradient descent, transformers and other neural networks, social networks, collaborative filtering), applications (chatbots, information retrieval, social computing, recommender systems), and ethical and social issues.  Prerequisites: CS106B, Python (at the level of CS106A), CS109 (or equivalent background in probability), and programming maturity and knowledge of UNIX equivalent to CS107 (or taking CS107 or CS1U concurrently).",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Jurafsky, D. (PI)"
    ]
  },
  {
    "id": "CS 129",
    "title": "Applied Machine Learning",
    "description": "(Previously numbered CS 229A.) You will learn to implement and apply machine learning algorithms. This course emphasizes practical skills, and focuses on giving you skills to make these algorithms work. You will learn about commonly used learning techniques including supervised learning algorithms (logistic regression, linear regression, SVM, neural networks/deep learning), unsupervised learning algorithms (k-means), as well as learn about specific applications such as anomaly detection and building recommender systems. This class is taught in the flipped-classroom format. You will watch videos and complete in-depth programming assignments and online quizzes at home, then come to class for discussion sections. This class will culminate in an open-ended final project, which the teaching team will help you on. Prerequisites: Programming at the level of CS106B or 106X, and basic linear algebra such as Math 51.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Bensouda Mourri, Y. (PI)",
      "Ng, A. (PI)",
      "Hosgur, E. (GP)"
    ]
  },
  {
    "id": "CS 131",
    "title": "Computer Vision: Foundations and Applications",
    "description": "Computer Vision technologies are transforming automotive, healthcare, manufacturing, agriculture and many other sections. Today, household robots can navigate spaces and perform duties, search engines can index billions of images and videos, algorithms can diagnose medical images for diseases, and smart cars can see and drive safely. Lying in the heart of these modern AI applications are computer vision technologies that can perceive, understand, and reconstruct the complex visual world. This course is designed for students who are interested in learning about the fundamental principles and important applications of Computer Vision. This course will introduce a number of fundamental concepts in image processing and expose students to a number of real-world applications. It will guide students through a series of projects to implement cutting-edge algorithms. There will be optional discussion sections on Fridays. Prerequisites: Students should be familiar with Python, Calculus & Linear Algebra.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Gaidon, A. (PI)",
      "Niebles Duque, J. (PI)"
    ]
  },
  {
    "id": "CS 132",
    "title": "AI as Technology Accelerator",
    "description": "How is AI accelerating breakthroughs in fields like biotechnology, neuroscience, and cybersecurity? How are other fields (semiconductors, material sciences advances) influencing the development of AI? What opportunities and challenges arise as these domains converge? These are some of the key questions this course addresses. This course brings the Stanford Emerging Technology Review, a pioneering partnership between the School of Engineering, Institute for Human-Centered AI, and the Hoover Institution, into the classroom - offering a technically grounded, human-centered and interdisciplinary examination of key emerging technology areas like cybersecurity, biotechnology, neuroscience, space technologies, and material sciences, and their intersection with AI advancements that shape the future of science, engineering, and society. Each week, a leading Stanford faculty or fellow will present a seminar on one or multiple domains, emphasizing foundational concepts and computational challenges, current technical advances with AI, and over-the-horizon implications for individual users, communities, and broader society. The course is structured to balance technical breadth and depth, offering students an integrated view of technical innovation and its real-world consequences. Emphasis is placed on understanding both the mechanics of each technology and the broader factors that influence its development and adoption, such as economic incentives, security risks, and ethical considerations. This course is ideal for upper-level undergraduate and graduate students who want to engage with cutting-edge research, think critically about the future of technology and their research, and interact directly with experts at the intersection of science, society, and policy.",
    "terms": [
      "Spr"
    ],
    "units": "2",
    "instructors": [
      "Lamparth, M. (PI)"
    ]
  },
  {
    "id": "CS 137A",
    "title": "Principles of Robot Autonomy I (AA 174A, EE 160A)",
    "description": "Basic principles for endowing mobile autonomous robots with perception, planning, and decision-making capabilities. Algorithmic approaches for robot perception, localization, and simultaneous localization and mapping; control of non-linear systems, learning-based control, and robot motion planning; introduction to methodologies for reasoning under uncertainty, e.g., (partially observable) Markov decision processes. Extensive use of the Robot Operating System (ROS) for demonstrations and hands-on activities. Prerequisites: CS 106A or equivalent, CME 100 or equivalent (for linear algebra), and CME 106 or equivalent (for probability theory).",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Pavone, M. (PI)",
      "Ganai, M. (TA)",
      "Kim, Y. (TA)",
      "Kwok, J. (TA)"
    ]
  },
  {
    "id": "CS 139",
    "title": "Human-Centered AI",
    "description": "Artificial Intelligence technology can and must be guided by human concerns. The course examines how mental models and user models of AI systems are formed, and how that leads to user expectations. This informs a set of design guidelines for building AI systems that are trustworthy, understandable, fair, and beneficial. The course covers the impact of AI systems on the economy and everyday life, and ethical issues of collecting data and running systems, including respect for persons, beneficence, fairness and justice.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Norvig, P. (PI)",
      "Russell, D. (PI)",
      "Adegbesan, A. (TA)",
      "Moser, T. (TA)"
    ]
  },
  {
    "id": "CS 140E",
    "title": "Operating systems design and implementation",
    "description": "Students will implement a simple, clean operating system (virtual  memory, processes, file system) in the  C programming language, on a rasberry pi computer and use the result to run a variety of devices and implement a final project.  All hardware is supplied by the instructor, and no previous experience with operating systems, raspberry pi, or embedded programming is required.Enrollment is by application: https://forms.gle/1UuHUJsWSRGLSH8BA",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Engler, D. (PI)"
    ]
  },
  {
    "id": "CS 141",
    "title": "Sports and Data",
    "description": "This course introduces undergraduates to data analytics and AI, using sports as the motivating application. Through real-world examples from professional sports, students will explore concepts such as exploratory data analysis, regression, classification, clustering, dimensionality reduction, and neural networks. Weekly assignments and a final team project will develop students' skills in using Python-based tools for sports analytics. A light final exam tests key conceptual understanding. Prerequisite: CS106A (or equivalent Python background) and CS109 (or equivalent probability background). TA sessions will cover use of pandas and other libraries students will use for projects, as well as freely available sports datasets that could be used.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Rajaraman, A. (PI)"
    ]
  },
  {
    "id": "CS 143",
    "title": "Compilers",
    "description": "Principles and practices for design and implementation of compilers and interpreters. Topics: lexical analysis; parsing theory; symbol tables; type systems; scope; semantic analysis; intermediate representations; runtime environments; code generation; and basic program analysis and optimization. Students construct a compiler for a simple object-oriented language during course programming projects. Prerequisites: 103 or 103B, 107 equivalent, or consent from instructor.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Kjoelstad, F. (PI)"
    ]
  },
  {
    "id": "CS 144",
    "title": "Introduction to Computer Networking",
    "description": "Principles and practice. Structure and components of computer networks, with focus on the Internet. Packet switching, layering, and routing. Transport and TCP: reliable delivery over an unreliable network, flow control, congestion control. Network names, addresses and ethernet switching.  Includes significant programming component in C/C++; students build portions of the internet TCP/IP software.  Prerequisite: CS110.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Winstein, K. (PI)",
      "Boneh, N. (TA)",
      "Heer, S. (TA)",
      "Ho, D. (TA)",
      "Marquez, C. (GP)",
      "Nasra, M. (TA)",
      "Podosin, K. (TA)",
      "Xiao, C. (TA)"
    ]
  },
  {
    "id": "CS 145",
    "title": "Introduction to Big Data Systems",
    "description": "Introduction to the use, design, and implementation of database and data-intensive systems, including data models; schema design; data storage; query processing, query optimization, and cost estimation; concurrency control, transactions, and failure recovery; distributed and parallel execution; semi-structured databases; and data system support for advanced analytics and machine learning. Prereqs: CS106B or CS106X; CS103. Need to have a basic understanding of RAM, disks, sorting/hashing algorithms. Soft prereqs: One of CS161 or CS111.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Shivakumar, N. (PI)",
      "Ja, M. (TA)",
      "Seyahi, L. (TA)",
      "Sharaf, A. (TA)",
      "Wang, R. (TA)",
      "Wang, Y. (TA)",
      "Yeung, B. (TA)"
    ]
  },
  {
    "id": "CS 146",
    "title": "Game Development",
    "description": "Game Programming teaches students the programming principles and workflows used in modern game development. Through hands-on projects in industry-standard game engines (Unity or Unreal), students implement core game mechanics, integrate AI techniques like NPC behavior and procedural content generation, and prototype interactive experiences. The course complements CS247G: Design for Play by focusing on technical implementation. Students complete a team-based final game project and learn from guest speakers from the game industry.",
    "terms": [
      "Win"
    ],
    "units": "2",
    "instructors": [
      "Landay, J. (PI)",
      "Yoon, S. (PI)"
    ]
  },
  {
    "id": "CS 146J",
    "title": "Full-Stack Web Programming",
    "description": "Have you ever wanted to build your own website and truly customize every part of it - not just use a website builder? Do you have a big idea for an app that you want to build for the web? This is the class for you! In this course, we'll cover the fundamentals of full-stack web development, from how to create a stunning frontend (the website your users see and interact with) and a robust backend (the server that forms the backbone of your website), with a focus on modern technologies that are widely used across the industry, from startups to large tech companies. While this course focuses primarily on the practice of programming web applications, we will also cover the conceptual aspects of how web technologies work. At the end, you'll work in a team to build a large web app of your own design from scratch! Prerequisites: CS 106B or equivalent programming experience. We expect that you will be comfortable picking up a new programming language quickly.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Cheng, A. (PI)"
    ]
  },
  {
    "id": "CS 146S",
    "title": "The Modern Software Developer",
    "description": "AI is rapidly transforming how we build, debug, and maintain software. From new-age IDEs and terminals like Cursor and Warp to code review and testing platforms like Coderabbit and Qodo, every phase of the software development life cycle is getting revamped. In this course, you'll explore how these tools are reshaping the craft of software engineering, making it more collaborative and iterative, enabling tremendous developer productivity. We'll connect the core principles of building complex systems with hands-on experience using state-of-the-art AI tools, guided by industry pioneers leading this revolution. Through real-world engineering tasks and a team-based project, you'll learn not just how to use the latest AI-powered workflows, but also when and why to trust them. Whether you're aiming to accelerate your productivity or rethink what it means to be a software engineer, this course will equip you with the skills and perspective to thrive in the era of AI-driven development.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Eric, M. (PI)",
      "Lin, F. (TA)"
    ]
  },
  {
    "id": "CS 147",
    "title": "Introduction to Human-Computer Interaction Design",
    "description": "Introduces fundamental methods and principles for designing, implementing, and evaluating user interfaces. Topics: user-centered design, rapid prototyping, experimentation, direct manipulation, cognitive principles, visual design, social software, software tools. Learn by doing: work with a team on a quarter-long design project, supported by lectures, readings, and studios. Prerequisite: 106B or X or equivalent programming experience. Recommended that CS Majors have also taken one of 142, 193P, or 193A.Please note: Less than 5 is only allowed for graduate students.",
    "terms": [
      "Aut"
    ],
    "units": "3-5",
    "instructors": [
      "Landay, J. (PI)",
      "Jacob, S. (TA)",
      "Maemoto, A. (TA)",
      "Patel, N. (TA)",
      "Sabharwal, D. (TA)",
      "Tang, C. (TA)",
      "Zhu, C. (TA)"
    ]
  },
  {
    "id": "CS 147L",
    "title": "Cross-platform Mobile App Development",
    "description": "The fundamentals of cross-platform mobile application development with a focus on the React Native framework (RN). Primary focus on developing best practices in creating apps for both iOS and Android by using Javascript and existing web + mobile development paradigms. Students will explore the unique aspects that made RN a primary tool for mobile development within Facebook, Instagram, Airbnb, Walmart, Tesla, and UberEats. Skills developed over the course will be consolidated by the completion of a final project. Required Prerequisites: CS106B.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Cheng, A. (PI)",
      "Landay, J. (PI)",
      "AbuHashem, Y. (TA)",
      "Blumencranz, J. (TA)",
      "Liu, K. (TA)",
      "Peng, E. (TA)"
    ]
  },
  {
    "id": "CS 148",
    "title": "Introduction to Computer Graphics and Imaging",
    "description": "This is the introductory prerequisite course in the computer graphics sequence which introduces students to the technical concepts behind creating synthetic computer generated images. The beginning of the course focuses on using Blender to create visual imagery, as well as an understanding of the underlying mathematical concepts including triangles, normals, interpolation, texture mapping, bump mapping, etc. Then we move on to a more fundamental understanding of light and color, as well as how it impacts computer displays and printers. From this we discuss more thoroughly how light interacts with the environment, and we construct engineering models such as the BRDF and discuss various simplifications into more basic lighting and shading models. Finally, we discuss ray tracing technology for creating virtual images, while drawing parallels between ray tracers and real world cameras in order to illustrate various concepts. Anti-aliasing and acceleration structures are also discussed. The final class project consists of building out a ray tracer to create a visually compelling image. Starter codes and code bits will be provided here and there to aid in development, but this class focuses on what you can do with the code as opposed to what the code itself looks like. Therefore grading is weighted towards in person \"demos\" of the code in action - creativity and the production of impressive visual imagery are highly encouraged.This is the first course in the computer graphics sequence at Stanford. Topics include: Scanline Rendering; Triangles; Rasterization; Transformations; Shading; Triangle Meshes; Subdivision; Marching Cubes; Textures; Light; Color; Cameras; Displays; Tone Mapping; BRDF; Lighting Equation; Global Illumination; Radiosity; Ray Tracing; Acceleration Structures; Sampling; Antialiasing; Reflection; Transmission; Depth of Field; Motion Blur; Monte Carlo; Bidirectional Ray Tracing; Light Maps.",
    "terms": [
      "Aut",
      "Sum"
    ],
    "units": "3-4",
    "instructors": [
      "Fedkiw, R. (PI)",
      "Fan, M. (TA)",
      "Fergesen, C. (TA)",
      "Garcia, N. (TA)",
      "Huang, F. (TA)",
      "Huh, J. (TA)",
      "Jovel, P. (TA)",
      "Kim, H. (TA)",
      "Koo, B. (TA)",
      "Lee, J. (TA)",
      "Li, F. (TA)",
      "Li, K. (GP)",
      "Liu, W. (TA)",
      "Lopez, A. (TA)",
      "Shu, L. (TA)",
      "Ye, K. (TA)"
    ]
  },
  {
    "id": "CS 149",
    "title": "Parallel Computing",
    "description": "This course is an introduction to parallelism and parallel programming. Most new computer architectures are parallel; programming these machines requires knowledge of the basic issues of and techniques for writing parallel software. Topics: varieties of parallelism in current hardware (e.g., fast networks, multicore, accelerators such as GPUs, vector instruction sets), importance of locality, implicit vs. explicit parallelism, shared vs. non-shared memory, synchronization mechanisms (locking, atomicity, transactions, barriers), and parallel programming models (threads, data parallel/streaming, MapReduce, Apache Spark, SPMD, message passing, SIMT, transactions, and nested parallelism). Significant parallel programming assignments will be given as homework. The course is open to students who have completed the introductory CS course sequence through 111.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Fatahalian, K. (PI)",
      "Olukotun, O. (PI)",
      "Chawla, S. (TA)",
      "Dharmarajan, K. (TA)",
      "Patil, A. (TA)",
      "Sriram, A. (TA)",
      "Wang, W. (TA)",
      "Weng, J. (TA)",
      "Xie, Z. (TA)",
      "Yu, W. (TA)",
      "Zhan, A. (TA)",
      "Zhang, G. (TA)"
    ]
  },
  {
    "id": "CS 151",
    "title": "Logic Programming",
    "description": "Logic Programming is a style of programming based on symbolic logic. In writing a logic program, the programmer describes the application area of the program (as a set of logical sentences) without reference to the internal data structures or operations of the system executing the program. In this regard, a logic program is more of a specification than an implementation; and logic programs are often called runnable specifications. This course introduces basic logic programming theory, current technology, and examples of common applications, notably deductive databases, logical spreadsheets, enterprise management, computational law, and game playing. Work in the course takes the form of readings and exercises, weekly programming assignments, and a term-long project. Prerequisite: CS 106B or equivalent.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Genesereth, M. (PI)"
    ]
  },
  {
    "id": "CS 152",
    "title": "Trust and Safety (COMM 122, INTLPOL 267)",
    "description": "Trust and Safety is an emerging field of professional and academic effort to build technologies that allow people to positively use the internet while being safe from harm. This course provides an introduction to the ways online services are abused to cause real human harm and the potential social, operational, product, legal and engineering responses. Students will learn about fraud, account takeovers, the use of social media by terrorists, misinformation, child exploitation, harassment, bullying and self-harm. This will include studying both the technical and sociological roots of these harms and the ways various online providers have responded. The class is taught by a practitioner, a professor of communication, a political scientist, and supplemented by guest lecturers from tech companies and nonprofits. Cross-disciplinary teams of students will spend the quarter building a technical and policy solution to a real trust and safety challenge, which will include the application of AI technologies to detecting and stopping abuse. For those taking this course for CS credit, the prerequisite is CS106B or equivalent programming experience and this course fulfills the Technology in Society requirement. Content note: This class will cover real-world harmful behavior and expose students to potentially upsetting material.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Hancock, J. (PI)",
      "Stamos, A. (PI)"
    ]
  },
  {
    "id": "CS 153",
    "title": "Infrastructure at Scale",
    "description": "This course is designed to help students understand the unique challenges of solving infrastructure problems at scale, and is co-taught by industry practitioners Michael Abbott (ex-GM, Apple, Twitter, Microsoft) and Anjney Midha (a16z, ex-Discord), who have led teams tackling hardware and software infrastructure for hundreds of millions of people. The format of the class will include guest lectures from experts in each theme, covering a blend of both theory and real-world scenarios. Past speakers include the CEOs, CTOs and CISOs of OpenAI, FireEye, Roblox, Cloudflare, Reddit and Google. Prerequisite: CS110/ CS111. Recommended but not required: CS155.",
    "terms": [
      "Spr"
    ],
    "units": "2",
    "instructors": [
      "Abbott, M. (PI)"
    ]
  },
  {
    "id": "CS 154",
    "title": "Introduction to the Theory of Computation",
    "description": "This course provides a mathematical introduction to the following questions: What is computation? Given a computational model, what problems can we hope to solve in principle with this model? Besides those solvable in principle, what problems can we hope to efficiently solve? In many cases we can give completely rigorous answers; in other cases, these questions have become major open problems in computer science and mathematics. By the end of this course, students will be able to classify computational problems in terms of their computational complexity (Is the problem regular? Not regular? Decidable? Recognizable? Neither? Solvable in P? NP-complete? PSPACE-complete?, etc.). Students will gain a deeper appreciation for some of the fundamental issues in computing that are independent of trends of technology, such as the Church-Turing Thesis and the P versus NP problem. Prerequisites: CS 103 or 103B.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Tan, L. (PI)",
      "Edholm, F. (TA)",
      "Fujimori, S. (TA)",
      "Sun, M. (TA)"
    ]
  },
  {
    "id": "CS 155",
    "title": "Computer and Network Security",
    "description": "For juniors, seniors, and first-year graduate students. Principles of computer systems security. Attack techniques and how to defend against them. Topics include: network attacks and defenses, operating system security, application security (web, apps, databases), malware, privacy, and security for mobile devices. Course projects focus on building reliable software. Prerequisite: 110. Recommended: basic Unix.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Dauterman, E. (PI)",
      "Durumeric, Z. (PI)"
    ]
  },
  {
    "id": "CS 157",
    "title": "Computational Logic",
    "description": "Rigorous introduction to Symbolic Logic from a computational perspective. Encoding information in the form of logical sentences.  Reasoning with information in this form.  Overview of logic technology and its applications - in mathematics, science, engineering, business, law, and so forth. Topics include the syntax and semantics of Propositional Logic, Relational Logic, and Herbrand Logic, validity, contingency, unsatisfiability, logical equivalence, entailment, consistency, natural deduction (Fitch), mathematical induction, resolution, compactness, soundness, completeness.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Genesereth, M. (PI)",
      "Garodia, V. (TA)",
      "Waititu, K. (TA)",
      "Zimmerman, L. (TA)"
    ]
  },
  {
    "id": "CS 161",
    "title": "Design and Analysis of Algorithms",
    "description": "Worst and average case analysis. Recurrences and asymptotics. Efficient algorithms for sorting, searching, and selection. Data structures: binary search trees, heaps, hash tables. Algorithm design techniques: divide-and-conquer, dynamic programming, greedy algorithms, amortized analysis, randomization. Algorithms for fundamental graph problems: minimum-cost spanning tree, connected components, topological sort, and shortest paths. Possible additional topics: network flow, string searching. Prerequisite: 106B or 106X; 103 or 103B; 109 or STATS 116.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-5",
    "instructors": [
      "Charikar, M. (PI)",
      "Rubinstein, A. (PI)",
      "Vitercik, E. (PI)",
      "Wootters, M. (PI)",
      "Atchariyachanvanit, T. (TA)",
      "Barnes, S. (TA)",
      "Bhasin, K. (TA)",
      "Cheng, J. (TA)",
      "Compton, S. (TA)",
      "Dai, A. (TA)",
      "Ding, Z. (TA)",
      "Fang, W. (TA)",
      "Kim, S. (TA)",
      "Malhotra, Z. (TA)",
      "Mao, X. (TA)",
      "Moon, B. (TA)",
      "Palaparthi, A. (TA)",
      "Sieh, I. (TA)",
      "Tu, T. (TA)",
      "Yang, M. (TA)"
    ]
  },
  {
    "id": "CS 161ACE",
    "title": "Problem-Solving Lab for CS161",
    "description": "Additional problem solving practice for CS161. Sections are designed to allow students to acquire a deeper understanding of CS and its applications, work collaboratively, and develop a mastery of the material. Concurrent enrollment in CS 161 required. Limited enrollment, permission of instructor, and application required.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Nag, A. (PI)"
    ]
  },
  {
    "id": "CS 166",
    "title": "Advanced Data Structures",
    "description": "This course is a deep dive into the design, analysis, implementation, and theory of data structures. Over the course of the quarter, we'll explore fundamental techniques in data structure design (isometries, amortization, randomization, etc.), as well as perspectives and intuitions useful for developing new data structures. By the time we've finished, we'll have seen some truly beautiful strategies for solving problems efficiently. Possible topics include Fibonacci heaps, fusion trees, succinct rank and select, B-trees, range minimum queries, suffix trees, dynamic connectivity, cuckoo hashing, and planar point location. Prerequisites: CS107 and CS161.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Schwarz, K. (PI)"
    ]
  },
  {
    "id": "CS 170",
    "title": "Stanford Laptop Orchestra: Composition, Coding, and Performance (MUSIC 128)",
    "description": "Classroom instantiation of the Stanford Laptop Orchestra (SLOrk) which includes public performances. An ensemble of more than 20 humans, laptops, controllers, and special speaker arrays designed to provide each computer-mediated instrument with its sonic identity and presence. Topics and activities include issues of composing for laptop orchestras, instrument design, sound synthesis, programming, and live performance. May be repeated four times for credit. Space is limited; see https://ccrma.stanford.edu/courses/128 for information about the application and enrollment process. May be repeat for credit",
    "terms": [
      "Spr"
    ],
    "units": "1-5",
    "instructors": [
      "Wang, G. (PI)",
      "Wright, M. (PI)",
      "Shaheed, N. (TA)"
    ]
  },
  {
    "id": "CS 171",
    "title": "Causality, Decision Making and Data Science (DATASCI 161, ECON 115)",
    "description": "Policymakers often need to make decisions when the implications of those decisions are not known with certainty. In many cases they rely in part on statistical evidence to guide these decisions. This requires statistical methods for estimating causal effects, that is the impact of these interventions. In this course we study how to analyze causal questions using statistical methods. We look at several causal questions in detail. For each case, we study various statistical and econometric methods that may shed light on these questions. We discuss what the critical assumptions are that underly these methods and how to assess whether the methods are appropriate for the settings at hand. We then analyze data sets, partly in class, and partly in assignments, to see how much we learn in practice. Pre-requisites: One quarter course in statistics, at the level of STATS 116 or STATS 117. Programming experience with Python will be helpful but is not required.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Imbens, G. (PI)",
      "Wootters, M. (SI)",
      "Flores, K. (GP)",
      "Venugopal, A. (TA)"
    ]
  },
  {
    "id": "CS 173A",
    "title": "Foundations of Computational Human Genomics (BMDS 173A, DBIO 173A)",
    "description": "(Only one of 173A or 273A counts toward any CS degree program.) A coder's primer to Computational Biology through the most amazing \"source code\" known: your genome. Examine the major forces of genome \"code development\" - positive, negative and neutral selection. Learn about genome sequencing (discovering your source code from fragments); genome content: variables (genes), control-flow (gene regulation), run-time stacks (epigenomics) and memory leaks (repeats); personalized genomics and genetic disease (code bugs);  genome editing (code injection); ultra conservation (unsolved mysteries) and code modifications behind amazing animal adaptations. Course includes primers on molecular biology and text processing. Prerequisites: comfortable coding in Python from the command line.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Bejerano, G. (PI)",
      "Tan, J. (GP)"
    ]
  },
  {
    "id": "CS 177",
    "title": "Human Centered Product Management",
    "description": "Ask any product person what the most important skills are for PMs and they'll say interpersonal dynamics - negotiation, communication, conflict resolution, research and more. This class will look at the role of product management in tech through a human-centered lens, including customers and coworkers. As well, students will experience the Agile-Lean development process and will be creating and testing prototypes. There is one major project: creating a new feature for a fictional business. This class could be taken before or after 147. There will be an additional required Studio/Lab scheduled when class begins.",
    "terms": [
      "Aut"
    ],
    "units": "3-5",
    "instructors": [
      "Wodtke, C. (PI)",
      "Loo, R. (TA)",
      "Mao, A. (GP)",
      "Pham, N. (TA)"
    ]
  },
  {
    "id": "CS 180",
    "title": "Digital Systems Architecture (EE 180)",
    "description": "The design of processor-based digital systems. Instruction sets, addressing modes, data types. Assembly language programming, low-level data structures, introduction to operating systems and compilers. Processor microarchitecture, microprogramming, pipelining. Memory systems and caches. Input/output, interrupts, buses and DMA. System design implementation alternatives, software/hardware tradeoffs. Labs involve the design of processor subsystems and processor-based embedded systems. Formerly EE 108B.",
    "terms": [
      "Win"
    ],
    "units": "4",
    "instructors": [
      "Kozyrakis, C. (PI)",
      "Angkanapiwat, B. (TA)",
      "Delgadillo, J. (TA)",
      "Lee, S. (TA)",
      "Zhu, W. (TA)"
    ]
  },
  {
    "id": "CS 182",
    "title": "Ethics, Public Policy, and Technological Change (COMM 180, ETHICSOC 182, PHIL 82, POLISCI 182, PUBLPOL 182)",
    "description": "Examination of recent developments in computing technology and platforms through the lenses of philosophy, public policy, social science, and engineering.  Course is organized around four main units: algorithmic decision-making and bias; data privacy and civil liberties; the power of private computing platforms; and the impact of generative AI.  Each unit considers the promise, perils, rights, and responsibilities at play in technological developments. Prerequisite: CS106A.",
    "terms": [
      "Win"
    ],
    "units": "5",
    "instructors": [
      "Reich, R. (PI)",
      "Sahami, M. (PI)"
    ]
  },
  {
    "id": "CS 182W",
    "title": "Ethics, Public Policy, and Technological Change (WIM)",
    "description": "Writing-intensive version of CS182. Satisfies the WIM requirement for Computer Science, Engineering Physics, STS, Math/Comp Sci, and Data Science undergraduates (and is only open to those majors). Prerequisite: CS106A. See CS182 for lecture day/time information for location/time of class. Enroll in either CS 182 or CS 182W, not both. Enrollment in WIM version of the course is limited to 100 students. Enrollment is restricted to seniors and coterminal students until January 6, 2025. Starting January 6, 2025, enrollment will open to all students if additional spaces remain available in the class.",
    "terms": [
      "Win"
    ],
    "units": "5",
    "instructors": [
      "Reich, R. (PI)",
      "Sahami, M. (PI)"
    ]
  },
  {
    "id": "CS 183E",
    "title": "Effective Leadership in High-Tech",
    "description": "You will undoubtedly leave Stanford with the technical skills to excel in your first few jobs. But non-technical skills are just as critical to making a difference. This seminar is taught by two industry veterans in engineering leadership and product management. In a small group setting, we will explore how you can be a great individual contributor (communicating with clarity, getting traction for your ideas, resolving conflict, and delivering your best work) and how you can transition into leadership roles (finding leadership opportunities, creating a great team culture, hiring and onboarding new team members). We will end by turning back to your career (picking your first job and negotiating your offer, managing your career changes, building a great network, and succeeding with mentors). Prerequisites: Preference given to seniors and co-terms in Computer Science and related majors. Enrollment limited and application required for admittance. Application (https://forms.gle/PaBcMmjratNGGtEi8) due 9/13/25.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Finley, M. (PI)",
      "Goldfein, J. (PI)"
    ]
  },
  {
    "id": "CS 186",
    "title": "How to Make a Moral Agent (PHIL 86)",
    "description": "Is it bad if you lie to ChatGPT? Who is to blame if ChatGPT lies? Should we let superhuman AI make life and death decisions? These questions ask whether advanced AI systems (today, often large language models - LLMs) can be moral agents - whether they are the kind of thing that can know how to make (ethically) correct decisions, and be held responsible for the rights or wrongs they do. Asking these questions leads us to questions about ourselves: What about us makes us moral agents? Is it our reason? Or is it essential that we emotionally feel each others' pain? Is selfishness irrational, or just unpleasant? Understanding ourselves can help us think about what kinds of artificial minds we would like to make, and, if we can, how. In this class, we provide the philosophical rigor and technical background necessary to robustly interrogate these and related questions. Readings will be drawn from philosophy, deep learning, and the cognitive sciences. The major assessment in this class will be a term project. There will be reading assignments for every class, and a mix of lectures, discussions, and participatory in-class activities. Recommended prerequisites: PHIL 80 or multiple philosophy courses; CS 183.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Gottlieb, D. (PI)",
      "Moore, J. (PI)"
    ]
  },
  {
    "id": "CS 191",
    "title": "Senior Project",
    "description": "Restricted to Computer Science students. Individual research projects under faculty direction. Enroll in the section that is led by your research instructor. The project must consist of publishable research. The research project may result in a paper publishable to an academic journal or presentable at a conference. A public presentation of research results is required. Prerequisite: Completion of at least 135 units and consent of instructor. Project proposal form is required before the beginning of the quarter of enrollment: https://www.cs.stanford.edu/bs-requirements-senior-project",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1-6",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Dally, B. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Linderman, S. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montanari, A. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Poldrack, R. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Song, S. (PI)",
      "Stamos, A. (PI)",
      "Subramonyam, H. (PI)",
      "Syrgkanis, V. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 191W",
    "title": "Writing Intensive Senior Research Project",
    "description": "Restricted to Computer Science students. Writing-intensive version of CS191. Enroll in the section that is led by your research instructor. Prerequisite: Completion of at least 135 units and consent of instructor. Project proposal form is required before the beginning of the quarter of enrollment: https://www.cs.stanford.edu/bs-requirements-senior-project",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "3-6",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Dally, B. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Linderman, S. (PI)",
      "Liu, K. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montanari, A. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Saberi, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Song, S. (PI)",
      "Stamos, A. (PI)",
      "Syrgkanis, V. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 192",
    "title": "Programming Service Project",
    "description": "Restricted to Computer Science students. Appropriate academic credit (without financial support) is given for volunteer computer programming work of public benefit and educational value. Enroll in the section that is led by your research instructor. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-4",
    "instructors": [
      "Achour, S. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Cain, J. (PI)",
      "Dally, B. (PI)",
      "Engler, D. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Gregg, C. (PI)",
      "Guibas, L. (PI)",
      "Hanrahan, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Koller, D. (PI)",
      "Kozyrakis, C. (PI)",
      "Lam, M. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Manning, C. (PI)",
      "McKeown, N. (PI)",
      "Mitchell, J. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Prabhakar, B. (PI)",
      "Rosenblum, M. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Schwarz, K. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Van Roy, B. (PI)",
      "Widom, J. (PI)",
      "Wu, J. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)"
    ]
  },
  {
    "id": "CS 193Q",
    "title": "Introduction to Python Programming",
    "description": "CS193Q teaches basic Python programming with a similar end-condition to CS106AP: strings, lists, numbers, dicts, loops, logic, functions, testings, decomposition and style, and modules. CS193Q assumes knowledge of some programming language, and proceeds by showing how each common programming idea is expressed in Python. CS193Q moves very quickly, meeting 3 times for 4 hours for a total of 12 hours which is a mixture of lecture and lab time.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Parlante, N. (PI)"
    ]
  },
  {
    "id": "CS 194",
    "title": "Software Project",
    "description": "Design, specification, coding, and testing of a significant team programming project under faculty supervision. Documentation includes capture of project rationale, design and discussion of key performance indicators, a weekly progress log and a software architecture diagram. Public demonstration of the project at the end of the quarter. Preference given to seniors. May be repeated for credit. Prerequisites: CS109 and CS161.",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Borenstein, J. (PI)"
    ]
  },
  {
    "id": "CS 194W",
    "title": "Software Project (WIM)",
    "description": "Restricted to Computer Science and Electrical Engineering undergraduates.  Writing-intensive version of CS194. Preference given to seniors. Prerequisites: CS109 and CS161.",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Borenstein, J. (PI)"
    ]
  },
  {
    "id": "CS 195",
    "title": "Supervised Undergraduate Research",
    "description": "Directed research under faculty supervision. Register using instructor's section number. Students are required to submit a written report and give a public presentation on their work. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-4",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Bouland, A. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Chang, E. (PI)",
      "Charikar, M. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Ho, D. (PI)",
      "Jurafsky, D. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Li, F. (PI)",
      "Liu, K. (PI)",
      "Manning, C. (PI)",
      "McClelland, J. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Olukotun, O. (PI)",
      "Pavone, M. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Re, C. (PI)",
      "Savarese, S. (PI)",
      "Tambe, T. (PI)",
      "Troccoli, N. (PI)",
      "Valiant, G. (PI)",
      "Vitercik, E. (PI)",
      "Wetzstein, G. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 197",
    "title": "Computer Science Research",
    "description": "An onramp for students interested in breaking new ground in the frontiers of computer science. Course format features faculty lectures introducing the fundamentals of computer science research, alongside special interest group meetings that provide mentorship and feedback on a real research project. Lecture topics include reading technical papers, practicing oral communication and technical writing skills, and independently formulating research questions. Any student may enroll for 4 units and select a research area (AI, HCI, Systems, etc.) for a quarter-long team programming project with a Ph.D. student mentor. Space may be limited. Prerequisite: CS106B.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Johansen, A. (PI)",
      "Singhal, A. (PI)",
      "Johansen, A. (TA)"
    ]
  },
  {
    "id": "CS 197C",
    "title": "Computer Science Research: CURIS Internship Onramp",
    "description": "A version of CS 197 designed specifically for students who will be participating in spring/summer CURIS internships  OR have an ongoing research project with a (Ph.D. student or professor) mentor in the Stanford Computer Science department. An onramp for students interested in breaking new ground in the frontiers of computer science. Course format features faculty lectures introducing the fundamentals of computer science research, alongside mentorship and feedback from the CURIS or research mentor on a real research project. Students will attend the same lectures as CS197 and may enroll for 3 units. Lecture topics include reading technical papers, practicing oral communication and technical writing skills, and independently formulating research questions. Students must have commitment from their CURIS or research mentor for weekly check-in meetings. Prerequisite: CS106B.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Johansen, A. (PI)"
    ]
  },
  {
    "id": "CS 198",
    "title": "Teaching Computer Science",
    "description": "Students lead a discussion section of 106A while learning how to teach a programming language at the introductory level. Focus is on teaching skills, techniques, and course specifics. Application and interview required; see http://cs198.stanford.edu.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Gonzalez-Maldonado, B. (PI)",
      "Gregg, C. (PI)",
      "Martz, E. (PI)",
      "Roberts-Baca, J. (PI)"
    ]
  },
  {
    "id": "CS 198B",
    "title": "Additional Topics in Teaching Computer Science",
    "description": "Students build on the teaching skills developed in CS198. Focus is on techniques used to teach topics covered in CS106B. Prerequisite: successful completion of CS198.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Ahmad-Stein, D. (PI)",
      "Gonzalez-Maldonado, B. (PI)",
      "Gregg, C. (PI)",
      "Martz, E. (PI)",
      "Roberts-Baca, J. (PI)",
      "Harrison, E. (GP)",
      "Mattei, M. (GP)",
      "Seay, P. (GP)"
    ]
  },
  {
    "id": "CS 199",
    "title": "Independent Work",
    "description": "Special study under faculty direction, usually leading to a written report. Enroll in the section that is led by your research instructor. Letter grade; if not appropriate, enroll in CS199P. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-6",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Chang, M. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dauterman, E. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Fox, E. (PI)",
      "Ganguli, S. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Ho, D. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Lin, H. (PI)",
      "Liu, K. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Paepcke, A. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Subramonyam, H. (PI)",
      "Tambe, T. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 199P",
    "title": "Independent Work",
    "description": "Special study under faculty direction, usually leading to a written report. Enroll in the section that is led by your research instructor. CR/NC only, if not appropriate, enroll in CS199. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-6",
    "instructors": [
      "Achour, S. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Dally, B. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guibas, L. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Lin, H. (PI)",
      "Liu, K. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Piech, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 202",
    "title": "Law for Computer Science Professionals",
    "description": "Businesses are built on ideas. Today's successful companies are those that most effectively generate, protect, and exploit new and valuable business ideas. Over the past 40 years, intellectual capital has emerged as the leading assets class.  Ocean Tomo® estimates that over 80% of the market value of S&P 500 corporations now stems from intangible assets, which consist largely of intellectual property (IP) assets (e.g., the company and product names, logos and designs; patentable inventions; proprietary software and databases, and other proprietary product, manufacturing and marketing information). It is therefore vital for entrepreneurs and other business professionals to have a basic understanding of IP and how it is procured, protected, and exploited. This course provides an overview of the many and varied IP issues that students will confront during their careers. It is intended to be both informative and fun. Classes will cover the basics of patent, trademark, copyright, and trade secret law. Current issues in these areas will be covered, including patent protection for software and business methods, copyrightability of computer programs and APIs, issues relating to artificial intelligence, and the evolving protection for trademarks and trade secrets.  Emerging issues concerning the federal Computer Fraud & Abuse Act (CFAA) and hacking will be covered, as will employment issues, including employee proprietary information and invention assignment agreements, work made for hire agreements, confidentiality agreements, non-compete agreements and other potential post-employment restrictions. Recent notable lawsuits will be discussed, including Apple v. Samsung (patents), Alice Corp. v. CLS Bank (software and business method patents), Oracle v. Google (software/APIs), Waymo v. Uber (civil and criminal trade secret theft), and hiQ v. LinkedIn (CFAA). IP law evolves constantly and new headline cases that arise during the term are added to the class discussion. Guest lectures typically include experts on open source software; legal and practical issues confronted by business founders; and, consulting and testifying as an expert in IP litigation. Although many of the issues discussed will involve technology disputes, the course also covers IP issues relating to art, music, photography, and literature. Classes are presented in an open discussion format and they are designed to be enjoyed by students of all backgrounds and areas of expertise.",
    "terms": [
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Hansen, D. (PI)"
    ]
  },
  {
    "id": "CS 205L",
    "title": "Continuous Mathematical Methods with an Emphasis on Machine Learning",
    "description": "A survey of numerical approaches to the continuous mathematics used throughout computer science with an emphasis on machine and deep learning. Although motivated from the standpoint of machine learning, the course will focus on the underlying mathematical methods including computational linear algebra and optimization, as well as special topics such as automatic differentiation via backward propagation, momentum methods from ordinary differential equations, CNNs, RNNs, etc. Written homework assignments and (straightforward) quizzes focus on various concepts; additionally, students can opt in to a series of programming assignments geared towards neural network creation, training, and inference. (Replaces CS205A, and satisfies all similar requirements.) Prerequisites: Math 51; Math104 or MATH113 or equivalent or comfort with the associated material.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Fedkiw, R. (PI)",
      "Li, K. (GP)"
    ]
  },
  {
    "id": "CS 206",
    "title": "Exploring Computational Journalism (COMM 281)",
    "description": "This project-based course will explore the field of computational journalism, including the use of Data Science, Info Visualization, AI, and emerging technologies to help journalists discover and tell stories, understand their audience, advance free speech, and build trust.  This course is repeatable for credit; enrollment priority given to students taking it for the first time. Enrollment will be via application. Please submit an application to be considered for the course. Application link: https://forms.gle/WAScAdPa7gewv6yA7",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Agrawala, M. (PI)",
      "Brenner, R. (PI)",
      "Tumgoren, S. (PI)"
    ]
  },
  {
    "id": "CS 210A",
    "title": "Industry Innovation Lab",
    "description": "Two-quarter project course. Focus is on real-world software development. Corporate partners seed projects with loosely defined challenges from their R&D labs; students innovate to build their own compelling software solutions. Student teams are treated as start-up companies with a budget and a technical advisory board comprised of instructional staff and corporate liaisons. Teams will typically travel to the corporate headquarters of their collaborating partner, meaning some teams will travel internationally. Open loft classroom format such as found in Silicon Valley software companies. Exposure to: current practices in software engineering; techniques for stimulating innovation; significant development experience with creative freedoms; working in groups; real-world software engineering challenges; public presentation of technical work; creating written descriptions of technical work.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Borenstein, J. (PI)"
    ]
  },
  {
    "id": "CS 210B",
    "title": "Industry Innovation Lab",
    "description": "Continuation of CS210A. Focus is on real-world software development. Corporate partners seed projects with loosely defined challenges from their R&D labs; students innovate to build their own compelling software solutions. Student teams are treated as start-up companies with a budget and a technical advisory board comprised of the instructional staff and corporate liaisons. Teams will typically travel to the corporate headquarters of their collaborating partner, meaning some teams will travel internationally. Open loft classroom format such as found in Silicon Valley software companies. Exposure to: current practices in software engineering; techniques for stimulating innovation; significant development experience with creative freedoms; working in groups; real world software engineering challenges; public presentation of technical work; creating written descriptions of technical work.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Borenstein, J. (PI)"
    ]
  },
  {
    "id": "CS 212",
    "title": "Operating Systems and Systems Programming",
    "description": "Covers key concepts in computer systems through the lens of operatingsystem design and implementation.  Topics include threads, scheduling,processes, virtual memory, synchronization, multi-core architectures,memory consistency, hardware atomics, memory allocators, linking, I/O,file systems, and virtual machines.  Concepts are reinforced with fourkernel programming projects in the Pintos operating system.  This classmay be taken as an accelerated single-class alternative to the CS111,CS112 sequence; conversely, the class should not be taken by studentswho have already taken CS111 or CS112.",
    "terms": [
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Mazieres, D. (PI)"
    ]
  },
  {
    "id": "CS 217",
    "title": "Hardware Accelerators for Machine Learning",
    "description": "This course explores the design, programming, and performance of modern AI accelerators. It covers architectural techniques, dataflow, tensor processing, memory hierarchies, compilation for accelerators, and emerging trends in AI computing. This course will cover modern AI/ML algorithms such as convolutional neural nets, and Transformer-based models / LLMs. We will consider both training and inference for these models and discuss the impact of parameters such as batch size, precision, sparsity and compression on the accuracy of these models. Students will become familiar with hardware implementation techniques for using parallelism, locality, and low precision to implement the core computational kernels used in ML. Students will develop intuitions to make system-level trade-offs to design energy-efficient accelerators. Students will read recent research papers and complete a final design project.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Olukotun, O. (PI)",
      "Tambe, T. (PI)"
    ]
  },
  {
    "id": "CS 220",
    "title": "Researching, Presenting and Publishing Work in AI & Education (EDUC 481)",
    "description": "\"Which conference or journal is the right venue for my AI+education paper? How do I get CS folks to care about my education-focused work? How do I explain AI methods to a non-technical audience in education?\" These are a few of the most common questions we hear from students seeking to navigate the emergent field at the intersection of AI and education. This seminar provides an interdisciplinary forum for PhD students and advanced masters students from education, computer science, and related fields to support them with the complexities of conducting and disseminating research across disciplinary boundaries. Through collaborative discussions, presentations, and peer feedback, students will gain insights into effectively navigating and bridging technical and educational communities' research and publication norms.",
    "terms": [
      "Spr"
    ],
    "units": "2-4",
    "instructors": [
      "Demszky, D. (PI)"
    ]
  },
  {
    "id": "CS 221",
    "title": "Artificial Intelligence: Principles and Techniques",
    "description": "Artificial intelligence (AI) has had a huge impact in many areas, including medical diagnosis, speech recognition, robotics, web search, advertising, and scheduling. This course focuses on the foundational concepts that drive these applications. In short, AI is the mathematics of making good decisions given incomplete information (hence the need for probability) and limited computation (hence the need for algorithms). Specific topics include search, constraint satisfaction, game playing,n Markov decision processes, graphical models, machine learning, and logic. Prerequisites: CS 103 or CS 103B/X, CS 106B or CS 106X, CS 109, and CS 161 (algorithms, probability, and object-oriented programming in Python). We highly recommend comfort with these concepts before taking the course, as we will be building on them with little review.",
    "terms": [
      "Aut",
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Charikar, M. (PI)",
      "Ge, C. (PI)",
      "Koyejo, S. (PI)",
      "Liang, P. (PI)",
      "Yan, S. (PI)",
      "Arora, A. (TA)",
      "Badlani, A. (TA)",
      "Liu, K. (TA)",
      "Liu, L. (TA)",
      "Mlauzi, I. (TA)",
      "Oh, M. (TA)",
      "Ramirez, E. (TA)",
      "Wu, Z. (TA)"
    ]
  },
  {
    "id": "CS 223A",
    "title": "Introduction to Robotics (ME 320)",
    "description": "Robotics foundations in modeling, design, planning, and control. Class covers relevant results from geometry, kinematics, statics, dynamics, motion planning, and control, providing the basic methodologies and tools in robotics research and applications. Concepts and models are illustrated through physical robot platforms, interactive robot simulations, and video segments relevant to historical research developments or to emerging application areas in the field. Recommended: matrix algebra.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Ganguly, S. (PI)",
      "Khatib, O. (PI)"
    ]
  },
  {
    "id": "CS 224G",
    "title": "Apps With LLMs Inside",
    "description": "With ChatGPT, neural networks have had their Lisp moment. Conversation has become code and the model is the CPU for this ultimate programming language. A new universe of App development has opened up, and there are no guides for it, yet. This is a project course designed to explore the space of Apps built around LLMs, starting by playing with them, learning their limitations, and then applying a set of techniques to program them efficiently and effectively. Assignments are due on a two week \"sprint\" cadence to mimic a startup style environment. Guest lectures by area experts provide industry perspective.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Jannink, J. (PI)",
      "Whaley, J. (PI)",
      "Mock, A. (GP)"
    ]
  },
  {
    "id": "CS 224N",
    "title": "Natural Language Processing with Deep Learning (LINGUIST 284, SYMSYS 195N)",
    "description": "Methods for processing human language information and the underlying computational properties of natural languages. Focus on deep learning approaches: understanding, implementing, training, debugging, visualizing, and extending neural network models for a variety of language understanding tasks. Exploration of natural language tasks ranging from simple word level and syntactic processing to coreference, question answering, and machine translation. Examination of representative papers and systems and completion of a final project applying a complex neural network model to a large-scale NLP problem. Prerequisites: calculus and linear algebra; CS124, CS221, or CS229.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Choi, Y. (PI)",
      "Yang, D. (PI)"
    ]
  },
  {
    "id": "CS 224R",
    "title": "Deep Reinforcement Learning",
    "description": "Humans, animals, and robots faced with the world must make decisions and take actions in the world. Moreover, the decisions they choose affect the world they exist in - and those outcomes must be taken into account. This course is about algorithms for deep reinforcement learning - methods for learning behavior from experience, with a focus on practical algorithms that use deep neural networks to learn behavior from high-dimensional observations. Topics will include methods for learning from demonstrations, both model-based and model-free deep RL methods, methods for learning from offline datasets, and more advanced techniques for learning multiple tasks such as goal-conditioned RL, meta-RL, and unsupervised skill discovery. These methods will be instantiated with examples from domains with high-dimensional state and action spaces, such as robotics, visual navigation, and control. This course is complementary to CS234, which neither being a pre-requisite for the other. In comparison to CS234, this course will have a more applied and deep learning focus and an emphasis on use-cases in robotics and motor control.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Finn, C. (PI)"
    ]
  },
  {
    "id": "CS 224V",
    "title": "Conversational Virtual Assistants with Deep Learning",
    "description": "Generative AI, and in particular Large Language Models (LLMs), has already changed how we work and study.  But this is just the beginning, as it has the potential of assisting and perhaps eventually automating knowledge workers in all areas, from law, medicine, to teaching and mental health therapists.  This course will focus on the general principles and the latest research on methodologies and tools that can be applied to all domains.  This is a project-oriented course, where students will gain hands-on experience in either methodology research or applying the concepts to create useful assistants for a domain of their choice. Topics include: (1) growing LLMs' knowledge through a combination of manual supervised learning and self-learning, (2) stopping LLMs from hallucination by grounding them with external corpora of knowledge, which is necessary for handling new, live, private as well as long-tail data, (3) handling external data corpora in different domains including structured and unstructured data, (4) experimentation and evaluation of conversational assistants based on LLMs, (5) controlling LLMs to achieve tasks, (6) persuasive LLMs, (7) multilingual assistants, and (8) combining voice and graphical interfaces. Prerequisites: one of LINGUIST 180/280, CS 124, CS 224N, CS 224S, 224U.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Lam, M. (PI)",
      "Agrawal, V. (TA)",
      "Jain, A. (TA)",
      "Jiang, Y. (GP)",
      "Khatua, A. (GP)",
      "Saad-Falcon, J. (TA)",
      "Teaupa, A. (GP)",
      "Tjangnaka, W. (TA)"
    ]
  },
  {
    "id": "CS 224W",
    "title": "Machine Learning with Graphs",
    "description": "Many complex data can be represented as a graph of relationships between objects. Such networks are a fundamental tool for modeling complex social, technological, and biological systems. This course focuses on the computational, algorithmic, and modeling challenges specific to the analysis of massive graphs. By means of studying the underlying graph structure and its features, students are introduced to machine learning techniques and data mining tools apt to reveal insights on a variety of networks. Topics include: representation learning and Graph Neural Networks; algorithms for the World Wide Web; reasoning over Knowledge Graphs; influence maximization; disease outbreak detection, social network analysis. Prerequisites: CS109, any introductory course in Machine Learning.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Leskovec, J. (PI)",
      "Agrawal, A. (TA)",
      "Chen, A. (TA)",
      "Chen, T. (TA)",
      "Hosgur, E. (TA)",
      "Hua, H. (TA)",
      "Khalil, B. (TA)",
      "Monozon, N. (TA)",
      "Sahoo, P. (TA)",
      "Sanyal, J. (TA)",
      "Zhang, S. (TA)"
    ]
  },
  {
    "id": "CS 225A",
    "title": "Experimental Robotics",
    "description": "Hands-on laboratory course experience in robotic manipulation. Topics include robot kinematics, dynamics, control, compliance, sensor-based collision avoidance, and human-robot interfaces. Second half of class is devoted to final projects using various robotic platforms to build and demonstrate new robot task capabilities. Previous projects include the development of autonomous robot behaviors of drawing, painting, playing air hocket, yoyo, basketball, ping-pong or xylophone. Prerequisites: 223A or equivalent.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Khatib, O. (TA)"
    ]
  },
  {
    "id": "CS 227A",
    "title": "Robot Perception (EE 227)",
    "description": "Robot Perception is the cornerstone of modern robotics, enabling machines to interpret, understand, and respond to an array of sensory information they encounter.  In the course, students will study the basic principles of typical sensor hardware on a robotics system (e.g., vision, tactile, and acoustic sensors), the algorithms that process the raw sensory data, and make actionable decisions from that information. Over the course of the semester, students will incrementally build their own vision-based robotics system in simulation via a series of homework coding assignments. Students enrolling 4 units will be required to submit an additional final written report. Prerequisites: This course requires programming experience in python as well as basic knowledge of linear algebra. Most of the required mathematical concepts will be reviewed, but it will be assumed that students have strong programming skills. All the homework requires extensive programming.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Song, S. (PI)",
      "Pan, C. (TA)",
      "Pekarek, B. (TA)",
      "Sun, Z. (TA)"
    ]
  },
  {
    "id": "CS 227B",
    "title": "General Game Playing",
    "description": "A general game playing system accepts a formal description of a game to play it without human intervention or algorithms designed for specific games. Hands-on introduction to these systems and artificial intelligence techniques such as knowledge representation, reasoning, learning, and rational behavior. Students create GGP systems to compete with each other and in external competitions. Prerequisite: programming experience. Recommended: 103 or equivalent.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Genesereth, M. (PI)"
    ]
  },
  {
    "id": "CS 229",
    "title": "Machine Learning (STATS 229)",
    "description": "Topics: statistical pattern recognition, linear and non-linear regression, non-parametric methods, exponential family, GLMs, support vector machines, kernel methods, deep learning, model/feature selection, learning theory, ML advice, clustering, density estimation, EM, dimensionality reduction, ICA, PCA, reinforcement learning and adaptive control, Markov decision processes, approximate dynamic programming, and policy search. Prerequisites: knowledge of basic computer science principles and skills at a level sufficient to write a reasonably non-trivial computer program in Python/NumPy to the equivalency of CS106A, CS106B, or CS106X, familiarity with probability theory to the equivalency of CS 109, MATH151, or STATS 116, and familiarity with multivariable calculus and linear algebra to the equivalency of MATH51 or CS205.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "3-4",
    "instructors": [
      "Charikar, M. (PI)",
      "Fox, E. (PI)",
      "Guestrin, C. (PI)",
      "Koyejo, S. (PI)",
      "Ma, T. (PI)",
      "Ng, A. (PI)",
      "Re, C. (PI)",
      "Abdullah, S. (TA)",
      "Chen, M. (TA)",
      "Guan, A. (TA)",
      "Kouhana, A. (TA)",
      "Li, H. (TA)",
      "Lyles, N. (TA)",
      "Nayak, S. (TA)",
      "O'Carroll, L. (TA)",
      "Shen, H. (TA)",
      "Shi, A. (TA)",
      "Tang, A. (TA)",
      "Tian, S. (TA)",
      "Yang, T. (TA)",
      "Zhang, Z. (TA)"
    ]
  },
  {
    "id": "CS 230",
    "title": "Deep Learning",
    "description": "Deep Learning is one of the most highly sought after skills in AI. We will help you become good at Deep Learning. In this course, you will learn the foundations of Deep Learning, understand how to build neural networks, and learn how to lead successful machine learning projects. You will learn about Convolutional networks, RNNs, LSTM, Adam, Dropout, BatchNorm, Xavier/He initialization, and more. You will work on case studies from healthcare, autonomous driving, sign language reading, music generation, and natural language processing. You will master not only the theory, but also see how it is applied in industry. You will practice all these ideas in Python and in TensorFlow, which we will teach. AI is transforming multiple industries. After this course, you will likely find creative ways to apply it to your work. This class is taught in the flipped-classroom format. You will watch videos and complete in-depth programming assignments and online quizzes at home, then come in to class for advanced discussions and work on projects. This class will culminate in an open-ended final project, which the teaching team will help you on. Prerequisites: Familiarity with programming in Python and Linear Algebra (matrix / vector multiplications). CS 229 may be taken concurrently.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Katanforoosh, K. (PI)",
      "Ng, A. (PI)",
      "Agarwal, S. (TA)",
      "Akoush, B. (TA)",
      "Chen, A. (TA)",
      "Choi, H. (TA)",
      "Ho, C. (TA)",
      "Jaladi, S. (TA)",
      "Kankariya, Y. (TA)",
      "Lian, R. (TA)",
      "Wu, V. (TA)"
    ]
  },
  {
    "id": "CS 231N",
    "title": "Deep Learning for Computer Vision",
    "description": "Computer Vision has become ubiquitous in our society, with applications in search, image understanding, apps, mapping, medicine, drones, and self-driving cars. Core to many of these applications are visual recognition tasks such as image classification and object detection. Recent developments in neural network approaches have greatly advanced the performance of these state-of-the-art visual recognition systems. This course is a deep dive into details of neural-network based deep learning methods for computer vision. During this course, students will learn to implement, train and debug their own neural networks and gain a detailed understanding of cutting-edge research in computer vision. We will cover learning algorithms, neural network architectures, and practical engineering tricks for training and fine-tuning networks for visual recognition tasks.Prerequisites: Proficiency in Python - All class assignments will be in Python (and use numpy) (we provide a tutorial here for those who aren't as familiar with Python). If you have a lot of programming experience but in a different language (e.g. C/C++/Matlab/Javascript) you will probably be fine.College Calculus, Linear Algebra (e.g. MATH 19, MATH 51) -You should be comfortable taking derivatives and understanding matrix vector operations and notation. Basic Probability and Statistics (e.g. CS 109 or other stats course) -You should know basics of probabilities, gaussian distributions, mean, standard deviation, etc.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Adeli, E. (PI)",
      "Li, F. (PI)",
      "Durante, Z. (TA)"
    ]
  },
  {
    "id": "CS 233",
    "title": "Geometric and Topological Data Analysis (CME 251)",
    "description": "Mathematical and computational tools for the analysis of data with geometric content, such images, videos, 3D scans, GPS traces -- as well as for other data embedded into geometric spaces. Linear and non-linear dimensionality reduction techniques. Graph representations of data and spectral methods. The rudiments of computational topology and persistent homology on sampled spaces, with applications. Global and local geometry descriptors allowing for various kinds of invariances. Alignment, matching, and map/correspondence computation between geometric data sets. Annotation tools for geometric data. Geometric deep learning on graphs and sets. Function spaces and functional maps. Networks of data sets and joint learning for segmentation and labeling. Prerequisites: discrete algorithms at the level of CS161; linear algebra at the level of Math51 or CME103.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Guibas, L. (PI)"
    ]
  },
  {
    "id": "CS 234",
    "title": "Reinforcement Learning",
    "description": "To realize the dreams and impact of AI requires autonomous systems that learn to make good decisions. Reinforcement learning is one powerful paradigm for doing so, and it is relevant to an enormous range of tasks, including robotics, game playing, consumer modeling and healthcare. This class will briefly cover background on Markov decision processes and reinforcement learning, before focusing on some of the central problems, including scaling up to large domains and the exploration challenge. One key tool for tackling complex RL domains is deep learning and this class will include at least one homework on deep reinforcement learning. Prerequisites: proficiency in python, CS 229 or equivalents or permission of the instructor; linear algebra, basic probability.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Brunskill, E. (PI)"
    ]
  },
  {
    "id": "CS 235",
    "title": "Computational Methods for Biomedical Image Analysis and Interpretation (BMDS 260, BMP 260, RAD 260)",
    "description": "The latest biological and medical imaging modalities and their applications in research and medicine. Focus is on computational analytic and interpretive approaches to optimize extraction and use of biological and clinical imaging data for diagnostic and therapeutic translational medical applications. Topics include major image databases, fundamental methods in image processing and quantitative extraction of image features, structured recording of image information including semantic features and ontologies, indexing, search and content-based image retrieval. Case studies include linking image data to genomic,  phenotypic and clinical data, developing representations of image phenotypes for use in medical decision support and research applications and the role that biomedical imaging informatics plays in new questions in biomedical science. Includes a project. Enrollment for 3 units requires instructor consent. Prerequisites: programming ability at the level of CS 106A, familiarity with statistics, basic biology. Knowledge of Matlab or Python highly recommended.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Rusu, M. (PI)",
      "Cai, F. (TA)"
    ]
  },
  {
    "id": "CS 237A",
    "title": "Principles of Robot Autonomy I (AA 274A, EE 260A, ME 274A)",
    "description": "Basic principles for endowing mobile autonomous robots with perception, planning, and decision-making capabilities. Algorithmic approaches for robot perception, localization, and simultaneous localization and mapping; control of non-linear systems, learning-based control, and robot motion planning; introduction to methodologies for reasoning under uncertainty, e.g., (partially observable) Markov decision processes. Extensive use of the Robot Operating System (ROS) for demonstrations and hands-on activities. Prerequisites: CS 106A or equivalent, CME 100 or equivalent (for linear algebra), and CME 106 or equivalent (for probability theory).",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Schwager, M. (PI)",
      "Gao, N. (TA)",
      "Malhotra, R. (TA)",
      "Mani, P. (TA)",
      "Sumuk, A. (TA)",
      "Yang, J. (TA)"
    ]
  },
  {
    "id": "CS 238",
    "title": "Decision Making under Uncertainty (AA 228)",
    "description": "This course is designed to increase awareness and appreciation for why uncertainty matters, particularly for aerospace applications. Introduces decision making under uncertainty from a computational perspective and provides an overview of the necessary tools for building autonomous and decision-support systems. Following an introduction to probabilistic models and decision theory, the course will cover computational methods for solving decision problems with stochastic dynamics, model uncertainty, and imperfect state information. Topics include: Bayesian networks, influence diagrams, dynamic programming, reinforcement learning, and partially observable Markov decision processes. Applications cover: air traffic control, aviation surveillance systems, autonomous vehicles, and robotic planetary exploration. Prerequisites: basic probability and fluency in a high-level programming language.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Kochenderfer, M. (PI)",
      "Baker, K. (TA)",
      "Balamurugan, N. (TA)",
      "Barbosa Carneiro, A. (TA)",
      "Chudnovsky, J. (TA)",
      "Edwards, L. (TA)",
      "Fein, D. (TA)",
      "Garg, R. (TA)",
      "Kang, J. (TA)",
      "Khare, I. (TA)",
      "Lasic-Ellis, I. (TA)",
      "Narayanaswamy, C. (TA)",
      "Parjan, S. (TA)",
      "Ramkumar, S. (TA)",
      "Thomas, R. (TA)",
      "Venkatesh, V. (TA)",
      "Voss, A. (TA)",
      "Wang, J. (TA)",
      "Weatherspoon, S. (TA)",
      "Wu, B. (TA)"
    ]
  },
  {
    "id": "CS 238V",
    "title": "Validation of Safety Critical Systems (AA 228V)",
    "description": "Before deploying autonomous decision-making systems in high-stakes applications, it is important to ensure that they will operate as intended. This course presents a variety of mathematical concepts and algorithms that can be used to validate their performance in simulation. The course first introduces a framework for setting up validation problems using topics from model fitting, model validation, and property specification. The course then covers sampling-based validation techniques for tasks such as falsification and probability of failure estimation. The course concludes with an overview of formal methods for tasks such as reachability analysis. Topics include but are not limited to: mathematical modeling, temporal logic specifications, optimization-based falsification, Markov chain Monte Carlo, importance sampling, reachability analysis, model checking, satisfiability, and explainability. Applications are drawn from air traffic control, autonomous systems, and self-driving cars. Prerequisites: basic probability theory, multivariable calculus, and fluency in a high-level programming language",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Katz, S. (PI)",
      "Lasic-Ellis, I. (TA)"
    ]
  },
  {
    "id": "CS 240",
    "title": "Advanced Topics in Operating Systems",
    "description": "Recent research. Classic and new papers. Topics: virtual memory management, synchronization and communication, file systems, protection and security, operating system extension techniques, fault tolerance, and the history and experience of systems programming. Prerequisite: 140 or equivalent.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Rosenblum, M. (PI)",
      "Paper, M. (TA)"
    ]
  },
  {
    "id": "CS 240LX",
    "title": "Advanced Systems Laboratory, Accelerated",
    "description": "This is an implementation-heavy, lab-based class that covers similar topics as CS240, but by writing code versus discussing papers. Our code will run \"bare-metal\" (without an operating system) on the widely-used ARM-based raspberry pi.  Bare-metal lets us do interesting tricks without constantly fighting a lumbering, general-purpose OS that cannot get out of its own way. We will do ten projects, one per week, where each project covers two labs of (at a minimum) several hours each and a non-trivial amount of outside work.  The workload is significant, but I will aim to not waste your time. Prerequisite: CS140E or instructor permission.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Engler, D. (PI)"
    ]
  },
  {
    "id": "CS 242",
    "title": "Programming Languages",
    "description": "This course explores foundational models of computation, such as the lambda calculus and other small calculi,  and the incorporation of basic advances in PL theory into modern programming languages such as Haskell and Rust.  Topics include type systems (polymorphism, algebraic data types, static vs. dynamic), control flow (exceptions, continuations), concurrency/parallelism, metaprogramming, verification, and the semantic gap between computational models and modern hardware. The study of programming languages is equal parts systems and theory, looking at how a rigorous understanding of the semantics of computation enables formal reasoning about the behavior and properties of complex real-world systems.  Prerequisites: 103, 110.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Aiken, A. (PI)",
      "Hong, Q. (TA)",
      "Yadav, R. (TA)"
    ]
  },
  {
    "id": "CS 243",
    "title": "Program Analysis and Optimizations",
    "description": "Program analysis techniques used in compilers and software development tools to improve productivity, reliability, and security. The methodology of applying mathematical abstractions such as graphs, fixpoint computations, binary decision diagrams in writing complex software, using compilers as an example. Topics include data flow analysis, instruction scheduling, register allocation, parallelism, data locality, interprocedural analysis, and garbage collection. Prerequisites: 103 or 103B, and 107.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Lam, M. (PI)"
    ]
  },
  {
    "id": "CS 244C",
    "title": "Advanced Networking and Distributed Systems",
    "description": "Discussion of research papers in the areas of networking and distributed systems.  Topics covered include Internet fundamentals, distributed system fundamentals, network modeling and simulation, and scalable storage systems.  Students conduct a small research project of their choice in small groups and present their results at the end of the quarter.  Prerequisite: CS144 or equivalent.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Mazieres, D. (PI)",
      "Winstein, K. (PI)"
    ]
  },
  {
    "id": "CS 246",
    "title": "Mining Massive Data Sets",
    "description": "The availability of massive datasets is revolutionizing science and industry. This course discusses data mining and machine learning algorithms for analyzing very large amounts of data. Topics include: Big data systems (Hadoop, Spark); Link Analysis (PageRank, spam detection); Similarity search (locality-sensitive hashing, shingling, min-hashing); Stream data processing; Recommender Systems; Analysis of social-network graphs; Association rules; Dimensionality reduction (UV, SVD, and CUR decompositions); Algorithms for large-scale mining (clustering, nearest-neighbor search); Large-scale machine learning (decision tree ensembles); Multi-armed bandit; Computational advertising. Prerequisites: At least one of CS107 or CS145.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Leskovec, J. (PI)"
    ]
  },
  {
    "id": "CS 247A",
    "title": "Design for Artificial Intelligence (SYMSYS 195A)",
    "description": "A project-based course that builds on the introduction to design in CS147 by focusing on advanced methods and tools for research, prototyping, and user interface design. Studio based format with intensive coaching and iteration to prepare students for tackling real world design problems. This course takes place entirely in studios; you must plan on attending every studio to take this class. The focus of CS247A is design for human-centered artificial intelligence experiences. What does it mean to design for AI? What is HAI? How do you create responsible, ethical, human centered experiences? Let us explore what AI actually is and the constraints, opportunities and specialized processes necessary to create AI systems that work effectively for the humans involved. Prerequisites: CS147 or equivalent background in design thinking. In the event of a waitlist, acceptance to class based on an application provided on the first day of class.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Stanford, J. (PI)"
    ]
  },
  {
    "id": "CS 247B",
    "title": "Design for Behavior Change (SYMSYS 195B)",
    "description": "Over the last decade, tech companies have invested in shaping user behavior, sometimes for altruistic reasons like helping people change bad habits into good ones, and sometimes for financial reasons such as increasing engagement. In this project-based hands-on course, students explore the design of systems, information and interface for human use. We will model the flow of interactions, data and context, and crafting a design that is useful, appropriate and robust. Students will design and prototype utility apps or games as a response to the challenges presented. We will also examine the ethical consequences of design decisions and explore current issues arising from unintended consequences. There will be an additional required Studio/Lab scheduled when class begins.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Wodtke, C. (PI)"
    ]
  },
  {
    "id": "CS 247G",
    "title": "Design for Play (SYMSYS 195G)",
    "description": "The focus of CS247G is an introduction to theory and practice of designing games.  It's taught in a studio format; i.e. light on lecture, lots of activities and plenty of media. Attendance is mandatory. We will make digital and paper games, do rapid iteration and run user research studies appropriate to game design. This class has two projects and we will cover a variety of genres, from narrative to pure strategy.  If you are a non-cs major, you do not have to have taken CS147. We'd love to have music, art and writing students.",
    "terms": [
      "Spr",
      "Sum"
    ],
    "units": "3-4",
    "instructors": [
      "Wodtke, C. (PI)"
    ]
  },
  {
    "id": "CS 247S",
    "title": "Service Design (SYMSYS 195S)",
    "description": "A project-based course that builds on the introduction to design in CS147 by focusing on advanced methods and tools for research, prototyping, and user interface design. Studio based format with intensive coaching and iteration to prepare students for tackling real world design problems. This course takes place entirely in studios; you must plan on attending every studio to take this class. The focus of CS247S is Service Design. In this course we will be looking at experiences that address the needs of multiple types of stakeholders at different touchpoints - digital, physical, and everything in between. If you have ever taken an Uber, participated in the Draw, engaged with your bank, or ordered a coffee through the Starbucks app, you have experienced a service that must have a coordinated experience for the customer, the service provider, and any other stakeholders involved. Let us explore what specialized tools and processes are required to created these multi-faceted interactions. Prerequisites: CS147 or equivalent background in design thinking. In the event of a waitlist, acceptance to class based on an application provided on the first day of class.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Stanford, J. (PI)",
      "Macias, E. (TA)"
    ]
  },
  {
    "id": "CS 248A",
    "title": "Computer Graphics: Rendering, Geometry, and Image Manipulation",
    "description": "This course provides a comprehensive introduction to interactive computer graphics, focusing on fundamental concepts and techniques, as well as their cross-cutting relationship to multiple problem domains in interactive graphics (such as rendering, animation, geometry, image processing). Topics include: 2D and 3D drawing, sampling theory, interpolation, rasterization, image compositing, the real-time GPU graphics pipeline (and parallel rendering), VR rendering, geometric transformations, curves and surfaces, geometric data structures, subdivision, meshing, spatial hierarchies, image processing, time integration, physically-based animation, and inverse kinematics.  The course will involve several in-depth programming assignments and a self-selected final project that explores concepts covered in the class. Prerequisite: CS 107, MATH 51.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Fatahalian, K. (PI)"
    ]
  },
  {
    "id": "CS 248B",
    "title": "Fundamentals of Computer Graphics: Animation and Simulation",
    "description": "This course provides a comprehensive introduction to computer graphics, focusing on fundamental concepts and techniques in Computer Animation and Physics Simulation. Topics include numerical integration, 3D character modeling, keyframe animation, skinning/rigging, inverse kinematics, rigid body dynamics, deformable body simulation, and fluid simulation. Prerequisites: CS107 and MATH51.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "James, D. (PI)",
      "Liu, K. (PI)",
      "Li, Z. (TA)",
      "Yu, K. (TA)"
    ]
  },
  {
    "id": "CS 251",
    "title": "Cryptocurrencies and blockchain technologies",
    "description": "For advanced undergraduates and for graduate students.  The potential applications for Bitcoin-like technologies is enormous.  The course will cover the technical aspects of cryptocurrencies, blockchain technologies, and distributed consensus. Students will learn how these systems work, and how to engineer secure software that interacts with Blockchains like Bitcoin, Ethereum, and others. Prerequisite: CS110. Recommended: CS255.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Argyropoulos, A. (PI)",
      "Boneh, D. (PI)",
      "Waitz, A. (PI)",
      "Harris, R. (GP)",
      "Yiorkadjis, P. (TA)"
    ]
  },
  {
    "id": "CS 254",
    "title": "Computational Complexity",
    "description": "An introduction to computational complexity theory. Topics include the P versus NP problem and other major challenges of complexity theory; Space complexity: Savitch's theorem and the Immerman-Szelepscényi theorem; P, NP, coNP, and the polynomial hierarchy; The power of randomness in computation; Non-uniform computation and circuit complexity; Interactive proofs. Prerequisites: 154 or equivalent; mathematical maturity.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Tan, L. (PI)"
    ]
  },
  {
    "id": "CS 254B",
    "title": "Computational Complexity II",
    "description": "A continuation of CS254 (Computational Complexity). Topics include Barriers to P versus NP; The relationship between time and space, and time-space tradeoffs for SAT; The hardness versus randomness paradigm; Average-case complexity; Fine-grained complexity; Current and new areas of complexity theory research.  Prerequisite: CS254.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Tan, L. (PI)"
    ]
  },
  {
    "id": "CS 255",
    "title": "Introduction to Cryptography",
    "description": "For advanced undergraduates and graduate students. Theory and practice of cryptographic techniques used in computer security. Topics: encryption (symmetric and public key), digital signatures, data integrity, authentication, key management, PKI, zero-knowledge protocols, and real-world applications. Prerequisite: basic probability theory.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Boneh, D. (PI)"
    ]
  },
  {
    "id": "CS 256",
    "title": "Algorithmic Fairness",
    "description": "Machine learning and data analysis have enjoyed tremendous success in a broad range of domains. These advances hold the promise of great benefits to individuals, organizations and society. Undeniably, algorithms are informing decisions that reach ever more deeply into our lives, from news article recommendations to criminal sentencing decisions to healthcare diagnostics. This progress, however, raises (and is impeded by) a host of concerns regarding the societal impact of computation. A prominent concern is that these algorithms should be fair. Unfortunately, the hope that automated decision-making might be free of social biases is dashed on the data on which the algorithms are trained and the choices in their construction: left to their own devices, algorithms will propagate - even amplify - existing biases of the data, the programmers, and the decisions made in the choice of features to incorporate and measurements of 'fitness' to be applied. Addressing wrongful discrimination by algorithms is not only mandated by law and by ethics but is essential to maintaining the public trust in the current computation-driven revolution.The study of fairness is ancient and multi-disciplinary: philosophers, legal experts, economists, statisticians, social scientists and others have been concerned with fairness for as long as these fields have existed. Nevertheless, the scale of decision making in the age of big-data, the computational complexities of algorithmic decision making, and simple professional responsibility mandate that computer scientists contribute to this research endeavor. This is an intro to this booming area of research. Prerequisites: CS 161. I will be assuming some mathematical maturity, CS 154 is recommended.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Reingold, O. (PI)",
      "Chen, C. (TA)",
      "Weissberg, J. (TA)"
    ]
  },
  {
    "id": "CS 257",
    "title": "Introduction to Automated Reasoning",
    "description": "Automated logical reasoning has enabled substantial progress in many fields, including hardware and software verification, theorem-proving, and artificial in- telligence. Different application scenarios may require different automated rea- soning techniques and sometimes their combination. In this course, we will study widely-used logical theories as well as algorithms for answering whether formu- las in those theories are satisfiable. We will consider state-of-the-art automated reasoning techniques for propositional logic, first-order logic, and various first- order theories, such as linear arithmetic over reals and integers, uninterpreted functions, bit-vectors, and arrays. We will also consider ways to reason about combinations of those theories. Topics include: logical foundations, SAT-solving, techniques for first-order theorem proving, decision procedures for different first- order theories, theory combination, the DPLL(T) framework, and applications of automated reasoning in program analysis and hardware verification. Prerequisites: CS154 Introduction to the Theory of Computation, or CS106b Programming Abstractions and CS103 Mathematical Foundations of Computing, or consent of instructor",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Trippel, C. (PI)"
    ]
  },
  {
    "id": "CS 258",
    "title": "Quantum Cryptography",
    "description": "This course will give an overview of how the development of quantum computers will fundamentally change the landscape of modern cryptography. This course will cover both the threats and opportunities of quantum computers for cryptography, and will include the following topics: A study of quantum algorithms for attacking classical cryptography; Cryptographic tools that resist such attacks; Quantum protocols such as quantum money that achieve never-before-possible capabilities. The course is intended for advanced undergraduates and masters students.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Zhandry, M. (PI)",
      "Jett, S. (TA)",
      "Kohn, K. (TA)"
    ]
  },
  {
    "id": "CS 259Q",
    "title": "Quantum Computing",
    "description": "This course introduces the basics of quantum computing. Topics include: qubits, entanglement, and non-local correlations; quantum gates, circuits, and compilation algorithms; basic quantum algorithms such as Simon's algorithm and Grover's algorithm; Shor's factoring algorithm and the hidden subgroup problem; Hamiltonian simulation; stabilizer circuits, the Gottesman-Knill theorem, and the basics of quantum error correction. Prerequisites: Knowledge of linear algebra & discrete probability, and knowledge of algorithms OR quantum mechanics (or both)",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Bouland, A. (PI)"
    ]
  },
  {
    "id": "CS 261",
    "title": "Combinatorial Optimization (CME 310, MS&E 315)",
    "description": "Algorithms, algorithmic paradigms, and algorithmic tools for provably solving combinatorial optimization problems. Emphasis on graph optimization and discussion of approaches based on linear programming and continuous optimization. Potential optimization problems include both polynomial time solve-able problems, e.g., maximum flow, minimum cost flow, matching, assignment, minimum cut, matroid optimization, submodular function minimization, and NP-hard problems, e.g., Steiner trees, traveling salesperson, maximum cut. Potential paradigms and tools include: linear programming, multiplicative weight update method, algebraic methods, and spectral methods. Prerequisite: 161 or equivalent.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Sidford, A. (PI)"
    ]
  },
  {
    "id": "CS 265",
    "title": "Randomized Algorithms and Probabilistic Analysis (CME 309)",
    "description": "Randomness pervades the natural processes around us, from the formation of networks, to genetic recombination, to quantum physics. Randomness is also a powerful tool that can be leveraged to create algorithms and data structures which, in many cases, are more efficient and simpler than their deterministic counterparts. This course covers the key tools of probabilistic analysis, and application of these tools to understand the behaviors of random processes and algorithms. Emphasis is on theoretical foundations, though we will apply this theory broadly, discussing applications in machine learning and data analysis, networking, and systems. Topics include tail bounds, the probabilistic method, Markov chains, and martingales, with applications to analyzing random graphs, metric embeddings, random walks, and a host of powerful and elegant randomized algorithms. Prerequisites: CS 161 and STAT 116, or equivalents and instructor consent.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Wootters, M. (PI)"
    ]
  },
  {
    "id": "CS 269I",
    "title": "Incentives in Computer Science (MS&E 206)",
    "description": "Many 21st-century computer science applications require the design of software or systems that interact with multiple self-interested participants.  This course will provide students with the vocabulary and modeling tools to reason about such design problems.  Emphasis will be on understanding basic economic and game theoretic concepts that are relevant across many application domains, and on case studies that demonstrate how to apply these concepts to real-world design problems.  Topics include auction and contest design, equilibrium analysis, cryptocurrencies, design of networks and network protocols, reputation systems, social choice, and social network analysis.  Case studies include BGP routing, Bitcoin, eBay's reputation system, Facebook's advertising mechanism, Mechanical Turk, and dynamic pricing in Uber/Lyft. Prerequisites: CS106B/X and CS161, or permission from the instructor.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Rubinstein, A. (PI)"
    ]
  },
  {
    "id": "CS 272",
    "title": "Introduction to Biomedical Informatics Research Methodology (BIOE 212, BMDS 212, GENE 212)",
    "description": "Capstone Biomedical Data Science experience. Hands-on software building. Student teams conceive, design, specify, implement, evaluate, and report on a software project in the domain of biomedicine. Creating written proposals, peer review, providing status reports, and preparing final reports. Issues related to research reproducibility. Guest lectures from professional biomedical informatics systems builders on issues related to the process of project management. Software engineering basics. Because the team projects start in the first week of class, attendance that week is strongly recommended. Prerequisites: BIOMEDIN 210 or 214 or 215 or 217 or 260. Preference to BMI graduate students. Consent of instructor required.NOTE: For students in the Department of Biomedical Data Science Program, this core course MUST be taken as a letter grade only.",
    "terms": [
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Altman, R. (PI)",
      "Engelhardt, B. (PI)",
      "Wall, D. (PI)",
      "Rusu, M. (SI)",
      "Huynh, M. (TA)",
      "Kim, J. (TA)"
    ]
  },
  {
    "id": "CS 273B",
    "title": "Deep Learning in Genomics and Biomedicine (BMDS 273, GENE 236)",
    "description": "Recent breakthroughs in high-throughput genomic and biomedical data are transforming biological sciences into \"big data\" disciplines. In parallel, progress in deep neural networks are revolutionizing fields such as image recognition, natural language processing and, more broadly, AI. This course explores the exciting intersection between these two advances. The course will start with an introduction to deep learning and overview the relevant background in genomics and high-throughput biotechnology, focusing on the available data and their relevance. It will then cover the ongoing developments in deep learning (supervised, unsupervised and generative models) with the focus on the applications of these methods to biomedical data, which are beginning to produced dramatic results. In addition to predictive modeling, the course emphasizes how to visualize and extract interpretable, biological insights from such models. Recent papers from the literature will be presented and discussed. Experts in the field will present guest lectures. Students will be introduced to and work with popular deep learning software frameworks. Students will work in groups on a final class project using real world datasets. Prerequisites: College calculus, linear algebra, basic probability and statistics such as CS 109, and basic machine learning such as CS 229. No prior knowledge of genomics is necessary.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Kundaje, A. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 273C",
    "title": "Cloud Computing for Biology and Healthcare (BMDS 222, GENE 222)",
    "description": "Big Data is radically transforming healthcare. To provide real-time personalized healthcare, we need hardware and software solutions that can efficiently store and process large-scale biomedical datasets. In this class, students will learn the concepts of cloud computing and parallel systems' architecture. This class prepares students to understand how to design parallel programs for computationally intensive medical applications and how to run these applications on computing frameworks such as Cloud Computing and High Performance Computing (HPC) systems. Prerequisites: familiarity with programming in Python and R.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Kundaje, A. (PI)",
      "Snyder, M. (PI)",
      "Bahmani, A. (SI)"
    ]
  },
  {
    "id": "CS 274",
    "title": "Representations and Algorithms for Computational Molecular Biology (BIOE 214, BMDS 214, GENE 214)",
    "description": "Topics: This is a graduate level introduction to bioinformatics and computational biology, algorithms for alignment of biological sequences and structures, computing with strings, phylogenetic tree construction, hidden Markov models, basic structural computations on proteins, protein structure prediction, molecular dynamics and energy minimization, statistical analysis of 3D biological data, integration of data sources, knowledge representation and controlled terminologies for molecular biology, microarray analysis, chemoinformatics, pharmacogenetics, network biology.  Note:  For Fall 2021, Dr. Altman will be away on sabbatical and so class will be taught from lecture videos recorded in fall of 2018.  The class will be entirely online, with no scheduled meeting times.  Lectures will be released in batches to encourage pacing.  A team of TAs will manage all class logistics and grading.  Firm prerequisite: CS 106B.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Altman, R. (PI)",
      "Arteaga, S. (TA)",
      "Borkar, M. (TA)",
      "Cahoon, J. (TA)",
      "Silberg, J. (TA)"
    ]
  },
  {
    "id": "CS 275A",
    "title": "Symbolic Musical Information (MUSIC 253)",
    "description": "Properties of symbolic data for music applications including advanced notation systems, data durability, mark-up languages, optical music recognition, and data-translation tasks.  Hands-on work involves these digital score formats: Guido Music Notation, Humdrum, MuseData, MEI, MusicXML, SCORE, and MIDI internal code.",
    "terms": [
      "Win"
    ],
    "units": "2-4",
    "instructors": []
  },
  {
    "id": "CS 277",
    "title": "Foundation Models for Healthcare (BMDS 271, RAD 271)",
    "description": "Generative AI and large-scale self-supervised foundation models are poised to have a profound impact on human decision making across occupations. Healthcare is one such area where such models have the capacity to impact patients, clinicians, and other care providers. In this course, we will explore the training, evaluation, and deployment of generative AI and foundation models, with a focus on addressing current and future medical needs. The course will cover models used in natural language processing, computer vision, and multi-modal applications. We will explore the intersection of models trained on non-healthcare domains and their adaptation to domain-specific problems, as well as healthcare-specific foundation models. Prerequisites: Familiarity with machine learning principles at the level of CS 229, 231N, or 224N",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Chaudhari, A. (PI)",
      "Zou, J. (PI)",
      "Syeda-Mahmood, T. (SI)",
      "Buendia, A. (GP)",
      "Thakkar, N. (GP)"
    ]
  },
  {
    "id": "CS 278",
    "title": "Social Computing (SOC 174, SOC 274)",
    "description": "Today we interact with our friends and enemies, our team partners and romantic partners, and our organizations and societies, all through computational systems. How do we design these social computing systems - platforms for social media, online communities, and collaboration - to be effective and responsible? This course covers design patterns for social computing systems and the foundational ideas that underpin them.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": []
  },
  {
    "id": "CS 281",
    "title": "Ethics of Artificial Intelligence",
    "description": "Machine learning has become an indispensable tool for creating intelligent applications, accelerating scientific discoveries, and making better data-driven decisions. Yet, the automation and scaling of such tasks can have troubling negative societal impacts. Through practical case studies, you will identify issues of fairness, justice and truth in AI applications. You will then apply recent techniques to detect and mitigate such algorithmic biases, along with methods to provide more transparency and explainability to state-of-the-art ML models. Finally, you will derive fundamental formal results on the limits of such techniques, along with tradeoffs that must be made for their practical application. CS229 or equivalent classes or experience.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Guestrin, C. (PI)"
    ]
  },
  {
    "id": "CS 282",
    "title": "Computer Systems Architecture (EE 282)",
    "description": "Course focuses on how to build modern computing systems, namely notebooks, smartphones, and data centers, covering primarily their hardware architecture and certain system software aspects. For each system class, we cover the system architecture, processor technology, advanced memory hierarchy and I/O organization, power and energy management, and reliability. We will also cover topics such as interactions with system software, virtualization, solid state storage, and security. The programming assignments allow students to explore performance/energy tradeoffs when using heterogeneous hardware resources on smartphone devices.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Kozyrakis, C. (PI)",
      "Trippel, C. (PI)"
    ]
  },
  {
    "id": "CS 283",
    "title": "Governing Artificial Intelligence: Law, Policy, and Institutions (COMM 152A, COMM 252A, GLOBAL 245B, INTLPOL 245B, POLISCI 145B, POLISCI 445B)",
    "description": "The regulation of artificial intelligence may present the most pressing policy issue of our time.  AI represents more than just a technology or tool; it promises to revolutionize the economy and all social systems.  Governments around the world are struggling to keep up with the fast pace of AI development and to adapt existing regulatory regimes to these dramatic changes.  This course surveys current and emerging legal, policy and governance challenges related to artificial intelligence.  The course will explore regulatory initiatives and proposals from around the world, such as the European AI Act and U.S. Executive Orders, while also examining how existing laws related to privacy, data protection, intellectual property, civil rights, and national security apply to this developing technology.  The course will also cover the AI policy debates related to balancing innovation and safety in a variety of contexts, from autonomous vehicles and weapons, to social media and elections.  Cross-cutting themes will include: how law and policy affect the way important societal decisions are justified; the balance of power and responsibility between humans and machines in different settings; the incorporation of multiple values into AI decision-making frameworks; the interplay of norms and formal law; technical complexities that may arise as society scales deployment of AI systems; AI's implications for transnational law and governance and geopolitics; and similarities and differences to other domains of human activity raising regulatory trade-offs and affected by technological change. Note: The course is designed both for students who want a survey of the field and lack any technical knowledge, as well as students who are AI experts but wish to learn more about the relevant policy questions and law. Technical knowledge or familiarity with AI is not a prerequisite. Requirements: The course involves a considerable amount of reading plus active classroom discussion. Elements used in grading: Requirements include attendance, class participation and a research paper. After the term begins, students accepted into the course can transfer, with consent of the instructor, from section (01) into section (02), which meets the R requirement. Research Paper of roughly 25 pages.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Koyejo, S. (PI)",
      "Persily, N. (PI)",
      "Reich, R. (PI)",
      "Reuel, A. (PI)",
      "Fischli, R. (GP)"
    ]
  },
  {
    "id": "CS 287",
    "title": "Foundations of Healthcare Data for Machine Learning (BMDS 218)",
    "description": "This course explores how healthcare data is generated in practice¿and how these processes influence the development of robust, trustworthy machine learning models. Students will examine how clinical workflows, documentation habits, and institutional practices introduce bias, noise, missingness, and spurious correlations into datasets. The course emphasizes the often-overlooked reality that many model failures stem not from algorithmic design, but from subtle flaws in how data is collected, labeled, and interpreted. Through lectures, real-world case studies, and observation of clinical data workflows, students will develop practical tools for understanding and improving data quality and model reliability. Topics include assessing data quality, addressing missingness and label leakage, developing scalable and accurate annotation strategies, leveraging synthetic data, and monitoring data and models for drift over time. Students will also learn to evaluate how these data challenges impact model generalization and robustness.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Alsentzer, E. (PI)",
      "Daneshjou, R. (PI)"
    ]
  },
  {
    "id": "CS 293",
    "title": "Empowering Educators via Language Technology (EDUC 473)",
    "description": "This course explores the use of natural language processing (NLP) to support educators, by discovering, measuring, and analyzing high-leverage teaching practices. Topics include computational social science methods, ethics, bias and fairness, automated scoring, causal analyses, large language models, among others. Engaging with relevant papers, students will work towards a final project using NLP methods and a critical social scientific lens. Projects are pitched to a jury of educators at the end of the course.",
    "terms": [
      "Win"
    ],
    "units": "2-4",
    "instructors": [
      "Demszky, D. (PI)",
      "Tan, M. (TA)"
    ]
  },
  {
    "id": "CS 295",
    "title": "Software Engineering",
    "description": "Software specification, testing and verification. The emphasis is on automated tools for developing reliable software. The course covers material---drawn primarily from recent research papers---on the technologyunderlying these tools. Assignments supplement the lectures with hands-on experience in using these tools and customizing them for solving new problems.  The course is appropriate for students intending to pursue research in program analysis and verification, as well as for those who wish to add the use of advanced software tools to their skill set. Prerequisites: 108. Recommended: a project course such as 140, 143 or 145.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Achour, S. (PI)"
    ]
  },
  {
    "id": "CS 300",
    "title": "Departmental Lecture Series",
    "description": "Priority given to first-year Computer Science Ph.D. students. CS Masters students admitted if space is available.  Presentations by members of the department faculty, each describing informally his or her current research interests and views of computer science as a whole.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Reingold, O. (PI)",
      "Madrigal, H. (GP)"
    ]
  },
  {
    "id": "CS 309A",
    "title": "Cloud Computing Seminar",
    "description": "For science, engineering, computer science, business, education, medicine, and law students. Cloud computing is bringing information systems out of the back office and making it core to the entire economy. Furthermore with the advent of smarter machines cloud computing will be integral to building a more precision planet. This class is intended for all students who want to begin to understand the implications of this technology. Guest industry experts are public company CEOs who are either delivering cloud services or using cloud services to transform their businesses.",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Chou, T. (PI)"
    ]
  },
  {
    "id": "CS 321M",
    "title": "AI Measurement Science",
    "description": "Artificial Intelligence (AI) measurement science provides frameworks and methodologies for evaluating, benchmarking, and understanding AI systems. As AI systems become increasingly powerful and deploy into high-stakes domains, the need for rigorous measurement approaches has grown in importance. Current measurement approaches are often ad hoc, lacking theoretical grounding, and failing to connect to real-world use cases. This has led to a measurement crisis characterized by benchmark saturation, inconsistent evaluation methodologies, and difficulty in making valid claims about AI capabilities. This course will cover the foundations of AI measurement science from first principles and outline connections to the growing literature on the topic. This includes: validity theory as applied to AI evaluation, focusing on content, criterion, construct, external, and consequential validity; psychometric models for AI measurement, including item response theory and latent variable models; scaling laws and intervention effects, predicting the impacts of data, computing, and architecture choices; synthetic data generation for evaluation and its implications; governance and policy considerations around AI measurement. This is a graduate-level course. By the end of the course, students should be able to understand, implement, and critique state-of-the-art AI measurement approaches and be ready to conduct research on these topics.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Koyejo, S. (PI)"
    ]
  },
  {
    "id": "CS 323",
    "title": "The AI Awakening: Implications for the Economy and Society",
    "description": "This course examines how advances in AI are transforming the economy and society. Each week features guest speakers who are leaders in AI, economics, government, or industry, along with discussions of cutting-edge research and its implications. Designed primarily for graduate students in economics, business, computer science, and related fields, the course fosters interdisciplinary dialogue on the opportunities and challenges posed by AI.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Brynjolfsson, E. (PI)"
    ]
  },
  {
    "id": "CS 328",
    "title": "Foundations of Causal Machine Learning",
    "description": "Theoretical foundations of modern techniques at the intersection of causal inference and machine learning. Topics may include: semi-parametric inference and semi-parametric efficiency, modern statistical learning theory, Neyman orthogonality and double/debiased machine learning, theoretical foundations of high-dimensional linear regression, theoretical foundations of non-linear regression models, such as random forests and neural networks, adaptive non-parametric estimation of conditional moment models, estimation and inference on heterogeneous treatment effects, causal inference and reinforcement learning, off-policy evaluation, adaptive experimentation and inference.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Syrgkanis, V. (PI)"
    ]
  },
  {
    "id": "CS 329A",
    "title": "Self Improving AI Agents",
    "description": "This graduate seminar course covers the latest techniques and applications of AI agents that can continuously improve themselves through interaction with themselves and the environment. The course will start with self-improvement techniques for LLMs, such as constitutional AI, using learned/domain-specific verifiers, scaling test-time compute, and combining search with LLMs. We will then discuss the latest research in augmenting LLMs with tool use and retrieval techniques, and orchestrating AI capabilities with multimodal web interaction. We will next discuss multi-step reasoning and planning problems for agentic workflows, and the challenges in building robust evaluation and orchestration frameworks. Industry applications that will be discussed include coding agents, research assistants in STEM, robotics and more. Students will work on an original research project in this area, discuss the suggested readings in each class, and learn from invited academic and industry speakers. Prerequisites: CS224N or CS229S; Fluency in Python programming and using large language model APIs.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Chowdhery, A. (PI)",
      "Mirhoseini, A. (PI)",
      "Gamarra Lafuente, A. (TA)",
      "Reddy, S. (TA)",
      "Yang, K. (TA)",
      "Zou, C. (TA)"
    ]
  },
  {
    "id": "CS 329H",
    "title": "Machine Learning from Human Preferences",
    "description": "Human preference data has become crucial to the success of Machine Learning (ML) systems in many application domains, from personalization to post-training of language models. As ML systems are more and more widely deployed, understanding models, methods, and algorithms for learning from preference data becomes important for both scientists and practitioners. This course covers learning from preferences in supervised, active, and reinforcement/assistance settings, and covers aspects specific to preference data, such as preference heterogeneity and aggregation, interpretation of human feedback, and privacy. In coding tasks, students implement supervised reward modeling and assistance games.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Haupt, A. (PI)",
      "Koyejo, S. (PI)",
      "Chen, E. (TA)",
      "Doumbouya, M. (TA)",
      "Mandyam, A. (TA)"
    ]
  },
  {
    "id": "CS 329R",
    "title": "Race and Natural Language Processing (CSRE 329R, LINGUIST 281A, PSYCH 257A)",
    "description": "The goal of this practicum is to integrate methods from natural language processing with social scientific perspectives on race to build and/or analyze practical systems that address significant societal issues. Readings will be drawn broadly from across the social sciences and computer science. Projects may include large, complex datasets and involve community partnerships relevant to race and natural language processing. Graduate standing and instructor permission required. Students interested in participating should complete the online application for permission. Limited enrollment.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Eberhardt, J. (PI)",
      "Jurafsky, D. (PI)",
      "Alvarez, G. (GP)",
      "Suzgun, M. (TA)"
    ]
  },
  {
    "id": "CS 329T",
    "title": "Trustworthy Machine Learning: Building and evaluating agentic systems",
    "description": "This project-based course will introduce students to building and evaluating agentic AI applications powered by foundation models. The overriding theme of the course is that building an initial prototype AI system can often be completed easily but refining a prototype into something that is useful and reliable requires iterative improvement based on clear evaluation metrics. We will cover background in foundation models, prompting, and retrieval-augmented generation (RAG) before introducing full agentic AI architectures. For each architecture, the course will study methods for evaluation.  Students will complete introductory homework assignments to become familiar with retrieval-augmented generation (RAG)  and agentic AI. Students will then work in pairs or small teams to develop applications using agentic or other approaches and evaluate them by adapting evaluation methods presented in the class.Prerequisites: CS229 or similar introductory Python-based ML class; knowledge of deep learning such as CS230, CS231N; familiarity with ML frameworks in Python (scikit-learn, Keras) assumed.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Datta, A. (PI)",
      "Mitchell, J. (PI)",
      "Goldberg, J. (TA)",
      "Gupta, I. (TA)"
    ]
  },
  {
    "id": "CS 329X",
    "title": "Human Centered NLP (CS 129X)",
    "description": "Recent advances in natural language processing (NLP), especially around large pretrained models, have enabled extensive successful applications. However, there are growing concerns about the negative aspects of NLP systems, such as biases and a lack of input from users. This course gives an overview of human-centered techniques and applications for NLP, ranging from human-centered design thinking to human-in-the-loop algorithms, fairness, and accessibility. Along the way, we will cover machine-learning techniques which are especially relevant to NLP and to human experiences. Prerequisite: CS224N or CS224U, or equivalent background in natural language processing. Prerequisite: CS224N or CS224U, or equivalent background in natural language processing.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Yang, D. (PI)",
      "Deepak, A. (TA)",
      "Narayan, A. (TA)"
    ]
  },
  {
    "id": "CS 331X",
    "title": "AI for Algorithmic Reasoning and Optimization (MS&E 331)",
    "description": "Artificial intelligence is expanding the frontier of algorithm design, enabling new ways to reason about and solve complex optimization problems. This course explores how AI methods¿ranging from graph neural networks and diffusion models to large language models¿can be integrated into the algorithm design pipeline. We will study how to use machine learning to design new algorithms, enhance classical algorithms with data-driven components, and optimize algorithm performance in specific application domains. Topics will span both practical approaches, such as differentiable optimization and generative AI for combinatorial problems, to theoretical perspectives, including approximation guarantees and the limits of learned algorithms.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Vitercik, E. (PI)"
    ]
  },
  {
    "id": "CS 334",
    "title": "Robots and Arts: Creative Applications and Projects (TAPS 334R)",
    "description": "This interdisciplinary, project-based course at the Stanford Robotics Center (SRC) provides students with the unique opportunity to conceive, develop, and implement original creative robotics projects. This course is suitable to both undergraduate and graduate students from diverse backgrounds, including art, theater studies, music, engineering, computer science, and design. This course emphasizes creative problem-solving, collaborative teamwork, and hands-on application of robotic technologies. Students will work in groups to explore various technologies and spaces within the SRC, culminating in a public exhibition of their final projects. The course bridges artistic expression with engineering.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Cuan, C. (PI)",
      "Khatib, O. (PI)",
      "Sumuk, A. (TA)"
    ]
  },
  {
    "id": "CS 336",
    "title": "Language Modeling from Scratch",
    "description": "Language models serve as the cornerstone of modern natural language processing (NLP) applications and open up a new paradigm of having a single general purpose system address a range of downstream tasks. As the field of artificial intelligence (AI), machine learning (ML), and NLP continues to grow, possessing a deep understanding of language models becomes essential for scientists and engineers alike. This course is designed to provide students with a comprehensive understanding of language models by walking them through the entire process of developing their own. Drawing inspiration from operating systems courses that create an entire operating system from scratch, we will lead students through every aspect of language model creation, including data collection and cleansing for pre-training, transformer model construction, model training, and evaluation before deployment. Application required, apply at https://docs.google.com/forms/d/e/1FAIpQLSdW0HgT8MHzdM8cgapLWqX2ZPP1yHSX52R_r5JzF52poqXsHg/viewform",
    "terms": [
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Hashimoto, T. (PI)",
      "Liang, P. (PI)"
    ]
  },
  {
    "id": "CS 337",
    "title": "AI-Assisted Care (BIOE 277, MED 277, PSYC 278)",
    "description": "Today, anyone can train a near state-of-the-art machine learning model with a laptop, a dataset, and a few lines of code. For many applications, model building is no longer the rate-limiting step in using AI and machine learning to improve human health. In this course, we examine the other areas that need to be addressed -- from choosing the right problem, to moving technical advances into the clinical setting and making sure we are actually improving outcomes that matter. This course is geared at anyone who is looking to use AI and machine learning to make a real-world positive impact on human health. Students from all schools welcome. The course can be taken for 1 unit (lecture attendance/participation) or 2-4 units, which will include a project component. Class website: https://cs337.stanford.edu/",
    "terms": [
      "Aut"
    ],
    "units": "1-4",
    "instructors": [
      "Adeli, E. (PI)",
      "Kaushal, A. (PI)",
      "Li, F. (PI)",
      "Milstein, A. (PI)"
    ]
  },
  {
    "id": "CS 339R",
    "title": "Collaborative Robotics (ME 326)",
    "description": "This course focuses on how robots can be effective teammates with other robots and human partners. Concepts and tools will be reviewed for characterizing task objectives, robot perception and control, teammate behavioral modeling, inter-agent communication, and team consensus. We will consider the application of these tools to robot collaborators, wearable robotics, and the latest applications in the relevant literature. This will be a project-based graduate course, with the implementation of algorithms in either python or C++.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Kennedy, M. (PI)",
      "Pham, G. (TA)",
      "Strong, M. (TA)"
    ]
  },
  {
    "id": "CS 340LX",
    "title": "Advanced Operating System Lab: Accelerated (II)",
    "description": "This is an implementation-heavy, lab-based class that continues the topics from CS240LX. The labs will be more specialized, with an emphasis on research-worthy topics and techniques. The class format will follow CS240LX: two labs, twice a week, along with a set of research papers for context. Enrollment requires instructor permission.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Engler, D. (PI)"
    ]
  },
  {
    "id": "CS 342",
    "title": "Building for Digital Health (MED 253)",
    "description": "This project-based course will provide a comprehensive overview of key requirements in the design and full-stack implementation of a digital health research application. Several pre-vetted and approved projects from the Stanford School of Medicine will be available for students to select from and build. Student teams learn about all necessary approval processes to deploy a digital health solution (data privacy clearance/I RB approval, etc.) and be guided in the development of front-end and back-end infrastructure using best practices. The final project will be the presentation and deployment of a fully approved digital health research application. CS106A, CS106B, Recommended: CS193P/A, CS142, CS47, CS110. Limited enrollment for this course. Apply for enrollment permission here:  https://stanforduniversity.qualtrics.com/jfe/form/SV_8uGDTMoomnmJpn8",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Aalami, O. (PI)",
      "Guestrin, C. (SI)"
    ]
  },
  {
    "id": "CS 343D",
    "title": "Domain-Specific Programming Models and Compilers",
    "description": "This class will cover the principles and practices of domain-specific programming models and compilers for dense and sparse applications in scientific computing, data science, and machine learning. We will study programming models from the recent literature, categorize them, and discuss their properties. We will also discuss promising directions for their compilation, including the separation of algorithm, schedule, and data representation, polyhedral compilation versus rewrite rules, and sparse iteration theory. Prerequisites:  CS143 or equivalent",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Kjoelstad, F. (PI)"
    ]
  },
  {
    "id": "CS 347",
    "title": "Human-Computer Interaction: Foundations and Frontiers",
    "description": "(Previously numbered CS376.) How will the future of human-computer interaction evolve? This course equips students with the major animating theories of human-computer interaction by connecting those theories to modern innovations. Major theories are drawn from interaction (e.g., tangible and ubiquitous computing), social computing (e.g., Johansen matrix), and design (e.g., reflective practitioner, wicked problems); they span domains such as AI+HCI (e.g., mixed initiative interaction), accessibility (e.g., ability based design), and interface software tools (e.g., threshold/ceiling diagrams). Students read and discuss multiple papers per week. Prerequisites: For CS and Symbolic Systems undergraduates/masters students, CS147 or CS247. No prerequisite for PhD students or students outside of CS and Symbolic Systems.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Agrawala, M. (PI)"
    ]
  },
  {
    "id": "CS 348C",
    "title": "Computer Graphics: Animation and Simulation",
    "description": "Core mathematics and methods for computer animation and motion simulation. Traditional animation techniques. Physics-based simulation methods for modeling shape and motion: particle systems, constraints, rigid bodies, deformable models, collisions and contact, fluids, and fracture. Animating natural phenomena. Methods for animating virtual characters and crowds. Additional topics selected from data-driven animation methods, realism and perception, animation systems, motion control, real-time and interactive methods, and multi-sensory feedback. Recommended: CS 148 and/or 205A. Prerequisite: linear algebra.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "James, D. (PI)"
    ]
  },
  {
    "id": "CS 348K",
    "title": "Visual Computing Systems",
    "description": "Visual computing tasks such as computational photography, image/video understanding, and real-time 3D graphics are key responsibilities of modern computer systems ranging from sensor-rich smart phones, autonomous robots, and large data centers. These workloads demand exceptional system efficiency and this course examines the key ideas, techniques, and challenges associated with the design of parallel, heterogeneous systems that execute and accelerate visual computing applications. This course is intended for graduate and advanced undergraduate-level students interested in architecting efficient graphics, image processing, and computer vision systems (both new hardware architectures and domain-optimized programming frameworks) and for students in graphics, vision, and ML that seek to understand throughput computing concepts so they can develop scalable algorithms for these platforms. Students will perform daily research paper readings, complete simple programming assignments, and compete a self-selected term project. Prerequisites: CS 107 or equivalent. Highly recommended: Parallel Computing (CS149) or Computer Architecture (EE 282).  Students will benefit from some background in deep learning (CS 230, CS 231N), computer vision (CS 231A), digital image processing (CS 232) or computer graphics (CS248).",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Fatahalian, K. (PI)"
    ]
  },
  {
    "id": "CS 349D",
    "title": "Compound AI Systems",
    "description": "The emergence of foundation models has revolutionized AI applications, but the most powerful AI systems today are increasingly compound systems - compositions of multiple models, retrievers, tools, and traditional software components. This research seminar explores the intersection of cloud computing infrastructure and compound AI systems, covering both the infrastructure required to build and deploy these systems at scale and the architectural patterns that make them effective. Students will participate in guest lectures from leading experts across academia and industry, including leaders of companies like Databricks, OpenAI, Foundry, NVIDIA, Microsoft, and more, read and discuss papers, and complete a quarter-long project in groups of 2-3. Prerequisites: Background in computer systems, ML and deep learning is recommended but not required (CS 111/240, 144/244, 244B or 245).",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Kozyrakis, C. (PI)"
    ]
  },
  {
    "id": "CS 349F",
    "title": "Fabric Architectures For AI Systems",
    "description": "The course is concerned with the design and operation of the network fabrics which interconnect large-scale compute and storage nodes in modern AI GPU clusters, cloud computing systems, and \"time-sensitive systems\" like financial trading platforms and massive multi-player games.  We will consider architectures, protocols and algorithms which enable these network fabrics to deliver deterministic and ultra-low latency at near-100% goodput.  Topics include data center fabric architectures - the fat tree topology, transport protocols - congestion control and load balancing, and scheduling algorithms - job scheduling, fabric scheduling and their interaction.  A particular focus will be the contrast and synergy between the edge- and network-centric approaches to building high-performance network fabrics.  Students will hear from industry experts who design, operate and use large-scale GPU and CPU clusters. Recommended: Knowledge of basic Networking, OS, or Distributed Systems (CS 144, 140, or equivalent), as well as basic EE courses (EE 178) will be useful.",
    "terms": [
      "Spr"
    ],
    "units": "2",
    "instructors": [
      "Prabhakar, B. (PI)",
      "Rosenblum, M. (PI)"
    ]
  },
  {
    "id": "CS 349H",
    "title": "Software Techniques for Emerging Hardware Platforms (EE 349)",
    "description": "Research seminar on software techniques for emerging computational substrates with guest lectures from hardware designers from research and industry. This seminar explores the benefits of novel hardware technologies, the challenges gating broad adoption of these technologies, and how software techniques can help mitigate these challenges and improve the usability of these hardware platforms. Note that the computational substrates discussed vary depending on the semester. Topics covered include: In-memory computing platforms, dynamical system-solving mixed-signal devices, exible and bendable electronics, neuromorphic computers, intermittent computing platforms, ReRAMs, DNA-based storage, and optical computing platforms. Prerequisites: CS107 or CS107E (required) and EE180 (recommended).",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Achour, S. (PI)",
      "Yi, P. (TA)"
    ]
  },
  {
    "id": "CS 350S",
    "title": "Privacy-Preserving Systems",
    "description": "CS 350S explores systems that use cryptography to provide strong privacy guarantees. Students will learn about both modern cryptographic tools and systems techniques, and they will examine how these are used together in existing cryptographic systems to minimize overheads. The class will consist of faculty lectures, student presentations, and guest lectures to offer a real-world perspective. Topics will include transparency logs, oblivious RAM, private information retrieval, and multi-party computation. Over the course of the class, students will build a privacy-preserving system. Prerequisites: Students should have taken CS155 or equivalent.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Dauterman, E. (PI)",
      "Zhang, T. (TA)"
    ]
  },
  {
    "id": "CS 355",
    "title": "Advanced Topics in Cryptography",
    "description": "Topics: Pseudo randomness, multiparty computation, pairing-based and lattice-based cryptography, zero knowledge protocols, and new encryption and integrity paradigms. May be repeated for credit. Prerequisite: CS255.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Boneh, D. (PI)"
    ]
  },
  {
    "id": "CS 356",
    "title": "Topics in Computer and Network Security",
    "description": "Research  seminar covering foundational work and current topics in computer and network security. Students will read and discuss published research papers as well as complete an original research project in small groups. Open to Ph.D. and masters students as well as advanced undergraduate students. Prerequisites: While the course has no official prerequisites, students need a mature understanding of software systems and networks to be successful. We strongly encourage students to first take CS155: Computer and Network Security.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Durumeric, Z. (PI)",
      "Ruth, K. (TA)"
    ]
  },
  {
    "id": "CS 357S",
    "title": "Formal Methods for Computer Systems",
    "description": "The complexity of modern computer systems requires rigorous and systematic verification/validation techniques to evaluate their ability to correctly and securely support application programs. To this end, a growing body of work in both industry and academia leverages formal methods techniques to solve computer systems challenges. This course is a research seminar that will cover foundational work and current topics in the application of formal methods-style techniques (some possible examples include SAT/SMT, model checking, symbolic execution, theorem proving, program synthesis, fuzzing) to reliable and secure computer systems design. The course can be thought of as an applied formal methods course where the application is reliable and secure architecture, microarchitecture, and distributed systems design. Prior formal methods experience is not necessary. Students will read and discuss published research papers and complete an original research project. Open to PhD and masters students as well as advanced undergraduate students. Prerequisites: EE180 Digital Systems Architecture or comparable course, or consent of instructor.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Trippel, C. (PI)"
    ]
  },
  {
    "id": "CS 360",
    "title": "Simplicity and Complexity in Economic Theory (ECON 284)",
    "description": "Technology has enabled the emergence of economic systems of formerly inconceivable complexity. Nevertheless, some technology-related economic problems are so complex that either supercomputers cannot solve them in a reasonable time, or they are too complex for humans to comprehend. Thus, modern economic designs must still be simple enough for humans to understand, and must address computationally complex problems in an efficient fashion. This topics course explores simplicity and complexity in economics, primarily via theoretical models. We will focus on recent advances.  Key topics include (but are not limited to) resource allocation in complex environments, communication complexity and information aggregation in markets, robust mechanisms, dynamic matching theory, influence maximization in networks, and the design of simple (user-friendly) mechanisms. Some applications include paired kidney exchange, auctions for electricity and for radio spectrum, ride-sharing platforms, and the diffusion of information.  Prerequisites: Econ 203 or equivalent.",
    "terms": [
      "Spr"
    ],
    "units": "3-5",
    "instructors": [
      "Akbarpour, M. (PI)"
    ]
  },
  {
    "id": "CS 361",
    "title": "Engineering Design Optimization (AA 222, CME 222)",
    "description": "Design of engineering systems within a formal optimization framework. This course covers the mathematical and algorithmic fundamentals of optimization, including derivative and derivative-free approaches for both linear and non-linear problems, with an emphasis on multidisciplinary design optimization. Topics will also include quantitative methodologies for addressing various challenges, such as accommodating multiple objectives, automating differentiation, handling uncertainty in evaluations, selecting design points for experimentation, and principled methods for optimization when evaluations are expensive. Applications range from the design of aircraft to automated vehicles. Prerequisites: some familiarity with probability, programming, and multivariable calculus.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Kochenderfer, M. (PI)",
      "Fisher, A. (TA)"
    ]
  },
  {
    "id": "CS 372",
    "title": "Artificial General Intelligence for Reasoning, Planning, and Decision Making",
    "description": "Course Description:Large Language Models (LLMs) have revolutionized AI through remarkable pattern matching capabilities. However, the path to Artificial General Intelligence (AGI) requires advancing beyond unconscious (System 1) to conscious (System 2) processing. This research-oriented course explores fundamental approaches to elevate LLMs toward AGI capabilities through conscious reasoning, planning, and decision-making. Core Research Questions: 1. How can we enable LLMs to transition from pattern matching to conscious deliberation? 2. What frameworks support robust reasoning and verifiable decisions? 3. How do we implement planning and temporal awareness in LLM systems? 4. What role does multi-LLM agent collaboration play in advancing toward AGI capabilities? The course examines: 1. Theoretical foundations of consciousness in AI 2. Multi-LLM Agent Collaborative Intelligence (MACI) frameworks 3. Entropy-guided information exchange 4. Constitutional AI principles 5. Temporal reasoning and planning architectures. Through lectures, discussions, and hands-on projects, students will explore practical implementations across various domains. While healthcare provides immediate applications (diagnosis, treatment planning), the principles apply broadly to any field requiring AGI-level reasoning capabilities. Prerequisites: Machine Learning, Deep Learning",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Chang, E. (PI)"
    ]
  },
  {
    "id": "CS 375",
    "title": "Large-Scale Neural Network Modeling for Neuroscience (PSYCH 249)",
    "description": "The last ten years has seen a watershed in the development of large-scale neural networks in artificial intelligence.  At the same time, computational neuroscientists have discovered a surprisingly robust mapping between the internal components of these networks and real neural structures in the human brain.  In this class we will discuss a panoply of examples of such \"convergent man-machine evolution\", including: feedforward models of sensory systems (vision, audition, somatosensation); recurrent neural networks for dynamics and motor control; integrated models of attention, memory, and navigation; transformer models of language areas; self-supervised models of learning; and deep RL models of decision and planning. We will also delve into the methods and metrics for comparing such models to real-world neural data, and address how unsolved open problems in AI (that you can work on!) will drive forward novel neural models. Some meaningful background in modern neural networks is highly advised (e.g. CS229, CS230, CS231n, CS234, CS236, CS 330), but formal preparation in cognitive science or neuroscience is not needed (we will provide this).",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Kazemian, A. (PI)",
      "Yamins, D. (PI)"
    ]
  },
  {
    "id": "CS 377G",
    "title": "Designing Serious Games",
    "description": "In recent years, serious games have become both a booming industry and a powerful tool for education, helping to illuminate complex social and ecological challenges and inspiring meaningful engagement with their solutions. This project-based course introduces core principles of game design, with a focus on creating games that teach. Run as a hands-on studio, students will design and and prototype games aimed at social change and civic engagement. Through lectures and extensive readings, we will explore the fundamentals of game design in order to develop effective games that address pressing societal issues.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Wodtke, C. (PI)",
      "Nasser, B. (TA)"
    ]
  },
  {
    "id": "CS 377P",
    "title": "Read, Write, Play",
    "description": "The Read, Write, Play class is an interdisciplinary exploration into games as both interactive experiences and cultural artifacts. By analyzing both classic and contemporary games alongside diverse readings - from practical design to cultural critiques - students will develop a deep understanding of game design, programming and play, and games' impacts on players and society. The course encourages critical thinking and creative reflection by combining play with academic inquiry, structured through blog posts and discussions. Students will read, write, and engage in dynamic discussions that explore different perspectives, from game development to cultural impact. The course aims to empower students with the analytical and expressive skills to critically evaluate games as a medium and articulate their insights through writing.",
    "terms": [
      "Spr"
    ],
    "units": "1-3",
    "instructors": [
      "Wodtke, C. (PI)"
    ]
  },
  {
    "id": "CS 377Q",
    "title": "Designing for Accessibility (ME 214)",
    "description": "Designing for accessibility is a valuable and important skill in the UX community. As businesses are becomeing more aware of the needs and scope of people with some form of disability, the benefits of universal design, where designing for accessibility ends up benefiting everyone, are becoming more apparent. This class introduces fundamental Human Computer Interaction (HCI) concepts and skills in designing for accessibility through individual assignments. Student projects will identify an accessibility need, prototype a design solution, and conduct a user study with a person with a disability. This class focuses on the accessibility of UX with computers, mobile phones, VR, and has a design class prerequisite (e.g., CS147, ME115A).",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Tang, J. (PI)"
    ]
  },
  {
    "id": "CS 377U",
    "title": "Understanding Users",
    "description": "This project-based class focuses on understanding the use of technology in the world. Students will learn generative and evaluative research methods to explore how systems are appropriated into everyday life in a quarter-long project where they design, implement and evaluate a novel mobile application. Quantitative (e.g. A/B testing, instrumentation, analytics, surveys) and qualitative (e.g. diary studies, contextual inquiry, ethnography) methods and their combination will be covered along with practical experience applying these methods in their project. Prerequisites: CS 147, 193A/193P (or equivalent mobile programming experience).",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "Bentley, F. (PI)"
    ]
  },
  {
    "id": "CS 389",
    "title": "Internet Censorship",
    "description": "This graduate seminar provides an exploration of the rapidly evolving field of internet censorship and the sophisticated techniques developed to measure its extent and circumvent its mechanisms. The course is built upon a foundation of active engagement with classic and seminal research literature. A significant and defining component is a quarter-long research project where students will either replicate a key finding from existing literature or explore a novel research direction. The overarching goal is to equip students with a comprehensive understanding of the global censorship ecosystem, the technical skills to analyze its mechanism, and the critical thinking skills necessary to contribute meaningfully to the field. Prerequisites: Recommended background includes graduate standing, strong knowledge of computer networking (CS144/244), or computer security (CS155/255).",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Chai, Z. (PI)"
    ]
  },
  {
    "id": "CS 390A",
    "title": "Curricular Practical Training",
    "description": "Educational opportunities in high technology research and development labs in the computing industry. Qualified computer science students engage in internship work and integrate that work into their academic program. Students register under their faculty advisor during the quarter they are employed and complete a research report outlining their work activity, problems investigated, results, and follow-on projects they expect to perform. CS390A, CS390B, and CS390C may each be taken once.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1",
    "instructors": [
      "Achour, S. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Duchi, J. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fischer, M. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schramm, T. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Troccoli, N. (PI)",
      "Utterback, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 390B",
    "title": "Curricular Practical Training",
    "description": "Educational opportunities in high technology research and development labs in the computing industry. Qualified computer science students engage in internship work and integrate that work into their academic program. Students register under their faculty advisor during the quarter they are employed and complete a research report outlining their work activity, problems investigated, results, and follow-on projects they expect to perform. CS390A, CS390B, and CS390C may each be taken once.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1",
    "instructors": [
      "Achour, S. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dror, R. (PI)",
      "Duchi, J. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schramm, T. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Troccoli, N. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 390C",
    "title": "Curricular Practical Training",
    "description": "Educational opportunities in high technology research and development labs in the computing industry. Qualified computer science students engage in internship work and integrate that work into their academic program. Students register under their faculty advisor during the quarter they are employed and complete a research report outlining their work activity, problems investigated, results, and follow-on projects they expect to perform. CS 390A, CS390B, and CS390C may each be taken once.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1",
    "instructors": [
      "Achour, S. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Troccoli, N. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 390D",
    "title": "Part-time Curricular Practical Training",
    "description": "For qualified computer science PhD students only. Permission number required for enrollment; see the CS PhD program administrator in Gates room 195. Educational opportunities in high technology research and development labs in the computing industry. Qualified computer science PhD students engage in research and integrate that work into their academic program. Students register under their faculty advisor during the quarter they are employed and complete a research report outlining their work activity, problems investigated, results, and follow-on projects they expect to perform. Students on F1 visas should be aware that completing 12 or more months of full-time CPT will make them ineligible for Optional Practical Training (OPT).",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dror, R. (PI)",
      "Duchi, J. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hayden, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montanari, A. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Piech, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Saberi, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schwarz, K. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 399",
    "title": "Independent Project",
    "description": "Letter grade only. This course is for masters students only. Undergraduate students should enroll in CS199; PhD students should enroll in CS499. Letter grade; if not appropriate, enroll in CS399P. Enroll in the section that is led by your research instructor. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-9",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Akbarpour, M. (PI)",
      "Alsentzer, E. (PI)",
      "Altman, R. (PI)",
      "Bailey, C. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Borenstein, J. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dauterman, E. (PI)",
      "Demszky, D. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hennessy, J. (PI)",
      "Ho, D. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Paepcke, A. (PI)",
      "Pande, V. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Saberi, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schmidt, L. (PI)",
      "Schwager, M. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Subramonyam, H. (PI)",
      "Syrgkanis, V. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wodtke, C. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 399P",
    "title": "Independent Project",
    "description": "Graded satisfactory/no credit. This course is for masters students only. Undergraduate students should enroll in CS199; PhD students should enroll in CS499. S/NC only; if not appropriate, enroll in CS399. Enroll in the section that is led by your research instructor. Prerequisite: consent of instructor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-9",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Altman, R. (PI)",
      "Bailey, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Dally, B. (PI)",
      "Dror, R. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Fox, E. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Liu, K. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Re, C. (PI)",
      "Rosenblum, M. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Wodtke, C. (PI)",
      "Wu, J. (PI)",
      "Yang, D. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 407",
    "title": "Lytics Seminar (EDUC 407)",
    "description": "(Same as GSBGID 307) Students will learn to design technology mediated learning environments for adult learners, conduct research in those environments, and learn from prior EdTech failures. Grounded in various theoretical frameworks that inform the design of learning environments, the course explores how people learn and the evidence of learning that can be collected and modeled in online environments in real world contexts. The course also examines specific case studies of failed EdTech ventures to identify patterns and causes of failure.  Throughout the course we will consider ethical issues related to design and research in human learning.  Overall, this course will provide students with a foundation in learning theory and the skills and knowledge needed to design, implement, and evaluate effective technology mediated learning environments.",
    "terms": [
      "Spr"
    ],
    "units": "1-4",
    "instructors": [
      "Mitchell, J. (PI)",
      "Thille, C. (PI)"
    ]
  },
  {
    "id": "CS 422",
    "title": "Interactive and Embodied Learning (EDUC 234A)",
    "description": "Most successful machine learning algorithms of today use either carefully curated, human-labeled datasets, or large amounts of experience aimed at achieving well-defined goals within specific environments. In contrast, people learn through their agency: they interact with their environments, exploring and building complex mental models of their world so as to be able to flexibly adapt to a wide variety of tasks. One crucial next direction in artificial intelligence is to create artificial agents that learn in this flexible and robust way. Students will read and take turns presenting current works, and they will produce a proposal of a feasible next research direction. Prerequisites: CS229, CS231N, CS234 (or equivalent).",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Haber, N. (PI)"
    ]
  },
  {
    "id": "CS 432",
    "title": "Computer Vision for Education and Social Science Research (EDUC 463)",
    "description": "Computer vision -- the study of how to design artificial systems that can perform high-level tasks related to image or video data (e.g. recognizing and locating objects in images and behaviors in videos) -- has seen recent dramatic success. In this course, we seek to give education and social science researchers the know-how needed to apply cutting edge computer vision algorithms in their work as well as an opportunity to workshop applications. Prerequisite: python familiarity and some experience with data.",
    "terms": [
      "Win",
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Haber, N. (PI)"
    ]
  },
  {
    "id": "CS 448B",
    "title": "Data Visualization (EDUC 458, SYMSYS 195V)",
    "description": "Techniques and algorithms for creating effective visualizations based on principles from graphic design, visual art, perceptual psychology, and cognitive science.  Topics: graphical perception, data and image models, visual encoding, graph and tree layout, color, animation, interaction techniques, automated design.  Lectures, reading, and project.  There are no official prerequisites for the class, but familiarity with the material in CS147, CS148 and CS142 is especially useful. Most important is a basic working knowledge of, or willingness to learn, web- programming, especially JavaScript, Vega-Lite and D3.js.",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Agrawala, M. (PI)",
      "Karumanchi, R. (TA)",
      "Reddy, S. (TA)"
    ]
  },
  {
    "id": "CS 448I",
    "title": "Computational Imaging (EE 367)",
    "description": "Digital photography and basic image processing, convolutional neural networks for image processing, denoising, deconvolution, single pixel imaging, inverse problems in imaging, proximal gradient methods, introduction to wave optics, time-of-flight imaging, end-to-end optimization of optics and imaging processing. Emphasis is on applied image processing and solving inverse problems using classic algorithms, formal optimization, and modern artificial intelligence techniques. Students learn to apply material by implementing and investigating image processing algorithms in Python. Term project.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Wetzstein, G. (PI)",
      "Kim, S. (TA)"
    ]
  },
  {
    "id": "CS 448Z",
    "title": "Physically Based Animation and Sound",
    "description": "Intermediate level, emphasizing physically based simulation techniques for computer animation and synchronized sound synthesis. Topics vary from year to year, but include the simulation of acoustic waves, and integrated approaches to visual and auditory simulation of rigid bodies, deformable solids, collision detection and contact resolution, fracture, fluids and gases, and virtual characters. Students will read and discuss papers, and do programming projects. Prerequisite: None. Recommended: Prior exposure to computer graphics and/or scientific computing.",
    "terms": [
      "Spr"
    ],
    "units": "3-4",
    "instructors": [
      "James, D. (PI)"
    ]
  },
  {
    "id": "CS 470",
    "title": "Music and AI (MUSIC 356)",
    "description": "How do we make music with artificial intelligence? What does it mean to do so (and is it even a good idea)? How might we design systems that balance machine automation and human interaction? More broadly, how do we want to live with our technologies? Are there - and ought there be - limits to using AI for art? (And what is Art, anyway?) In this \"critical making\" course, students will learn practical tools and techniques for AI-mediated music creation, engineer software systems incorporating AI, HCI and Music, and critically reflect on the aesthetic and ethical dimensions of technology.",
    "terms": [
      "Win"
    ],
    "units": "3-4",
    "instructors": [
      "Kim, S. (PI)",
      "Wang, G. (PI)"
    ]
  },
  {
    "id": "CS 476A",
    "title": "Music, Computing, Design: The Art of Design (MUSIC 256A)",
    "description": "This course explores the artful design of software tools, toys, games,ninstruments, and experiences. Topics include programming, audiovisualndesign, strategies for crafting interactive systems, game design, asnwell as aesthetic and social considerations of shaping technology in ournworld today. Course work features several programming assignments withnan emphasis on critical design feedback, reading responses, and an\"design your own\" final project. Prerequisite: experience in C/C++/Javanor Unity/C#.  See https://ccrma.stanford.edu/courses/256a/",
    "terms": [
      "Aut"
    ],
    "units": "3-4",
    "instructors": [
      "Wang, G. (PI)",
      "Murakami, E. (TA)"
    ]
  },
  {
    "id": "CS 486",
    "title": "Advanced Large Language Models Research Seminar",
    "description": "This research seminar builds upon the theoretical foundations established in the lecture-based LLM courses, providing students with hands-on experience in conducting original research at the frontier of Large Language Model advancement toward AGI capabilities. Students will design, implement, and evaluate novel approaches to enhance LLM reasoning, planning, and multi-agent collaboration.",
    "terms": [
      "Spr"
    ],
    "units": "3",
    "instructors": [
      "Chang, E. (PI)"
    ]
  },
  {
    "id": "CS 498C",
    "title": "Introduction to CSCL: Computer-Supported Collaborative Learning (EDUC 315A)",
    "description": "This seminar introduces students to foundational concepts and research on computer-supported collaborative learning (CSCL). It is designed for LSTD doctoral students, LDT masters' students, other GSE graduate students and advanced undergraduates inquiring about theory, research and design of CSCL. CSCL is defined as a triadic structure of collaboration mediated by a computational artefact (participant-artifact-participant). CSCL encompasses two individuals performing a task together in a short time, small or class-sized groups, and students following the same course, digitally interacting.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Pea, R. (PI)",
      "Pittman, J. (TA)"
    ]
  },
  {
    "id": "CS 499",
    "title": "Advanced Reading and Research",
    "description": "Letter grade only. Advanced reading and research for CS PhD students. Register using the section number associated with the instructor. Prerequisite: consent of instructor. This course is for PhD students only. Undergraduate students should enroll in CS199, masters students should enroll in CS399. Letter grade; if not appropriate, enroll in CS499P.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-15",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Akbarpour, M. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boahen, K. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dauterman, E. (PI)",
      "Dror, R. (PI)",
      "Duchi, J. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fan, J. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Fox, J. (PI)",
      "Ganguli, S. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hayden, P. (PI)",
      "Hennessy, J. (PI)",
      "Ho, D. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Linderman, S. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montanari, A. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Raina, P. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Saberi, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schmidt, L. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Song, S. (PI)",
      "Subramonyam, H. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Utterback, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zhandry, M. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 499P",
    "title": "Advanced Reading and Research",
    "description": "Graded satisfactory/no credit. Advanced reading and research for CS PhD students. Register using the section number associated with the instructor. Prerequisite: consent of instructor. This course is for PhD students only. Undergraduate students should enroll in CS199, masters students should enroll in CS399. S/NC only; if not appropriate, enroll in CS499.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "1-15",
    "instructors": [
      "Achour, S. (PI)",
      "Adeli, E. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Akbarpour, M. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boahen, K. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Cain, J. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dally, B. (PI)",
      "Dauterman, E. (PI)",
      "Dror, R. (PI)",
      "Duchi, J. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fan, J. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Fogg, B. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Fox, J. (PI)",
      "Ganguli, S. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Gregg, C. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hayden, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Katti, S. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koller, D. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Linderman, S. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mirhoseini, A. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Ng, A. (PI)",
      "Niebles Duque, J. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Parlante, N. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Piech, C. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Raina, P. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Saberi, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Savarese, S. (PI)",
      "Schmidt, L. (PI)",
      "Schwarz, K. (PI)",
      "Sidford, A. (PI)",
      "Song, S. (PI)",
      "Subramonyam, H. (PI)",
      "Tan, L. (PI)",
      "Thrun, S. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Utterback, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Young, P. (PI)",
      "Zelenski, J. (PI)",
      "Zhandry, M. (PI)",
      "Zou, J. (PI)"
    ]
  },
  {
    "id": "CS 521",
    "title": "Seminar on AI Safety",
    "description": "In this seminar, we will focus on the challenges in the design of safe and verified AI-based systems. We will explore some of the major problems in this area from the viewpoint of industry and academia. We plan to have a weekly seminar speaker to discuss issues such as verification of AI systems, reward misalignment and hacking, secure and attack-resilient AI systems, diagnosis and repair, issues regarding policy and ethics, as well as the implications of AI safety in automotive industry. Prerequisites: There are no official prerequisites but an introductory course in artificial intelligence is recommended.",
    "terms": [
      "Spr"
    ],
    "units": "1",
    "instructors": []
  },
  {
    "id": "CS 522",
    "title": "Seminar in Artificial Intelligence in Healthcare",
    "description": "Artificial intelligence is poised to make radical changes in healthcare, transforming areas such as diagnosis, genomics, surgical robotics, and drug discovery. In the coming years, artificial intelligence has the potential to lower healthcare costs, identify more effective treatments, and facilitate prevention and early detection of diseases. This class is a seminar series featuring prominent researchers, physicians, entrepreneurs, and venture capitalists, all sharing their thoughts on the future of healthcare. We highly encourage students of all backgrounds to enroll (no AI/healthcare background necessary). Speakers and more at https://tinyurl.com/cs522-stanford",
    "terms": [
      "Aut"
    ],
    "units": "1",
    "instructors": [
      "Dror, R. (PI)",
      "Roh, K. (GP)",
      "Singh, S. (GP)"
    ]
  },
  {
    "id": "CS 524",
    "title": "AI for Science",
    "description": "AI is transforming scientific discovery - from protein structures prediction, to new materials discovery, to plasma control. This graduate¿level seminar surveys the emerging discipline of AI for Science, emphasizing the recurring ML-theoretic themes most salient to scientific regimes: e.g., multi¿scale modeling, multi¿modal architectures, differentiable simulation, and inference¿time reasoning. Weekly meetings pair a classical milestone (e.g., AlphaFold, AlphaGo) with a recent breakthrough (e.g., GNoME, GraphCast, TAE's Optometrist algorithm). Students read, present, and critique papers, replicate key results in lightweight coding labs, and pursue an open¿ended research project targeting new science or tooling.",
    "terms": [
      "Aut"
    ],
    "units": "3",
    "instructors": [
      "Davis, J. (PI)",
      "Leskovec, J. (PI)"
    ]
  },
  {
    "id": "CS 525",
    "title": "Data for AI",
    "description": "CS525 surveys the landscape of data for AI with a focus on contemporary learning problems such as training language models or multimodal models. Students will learn about important datasets and common data processing methods including filtering and deduplication. Further topics will include synthetic data, data attribution, and environments for reinforcement learning. The course will also cover ethical and legal aspects of training data such as copyright and privacy. Over the course of the class, students will build a training set for a learning problem of their choice. The class will consist of faculty lectures, student presentations, and guest lectures.",
    "terms": [
      "Win"
    ],
    "units": "3",
    "instructors": [
      "Schmidt, L. (PI)"
    ]
  },
  {
    "id": "CS 547",
    "title": "Human-Computer Interaction Seminar",
    "description": "Weekly speakers on human-computer interaction topics. May be repeated for credit.",
    "terms": [
      "Aut",
      "Win",
      "Spr"
    ],
    "units": "1",
    "instructors": [
      "Subramonyam, H. (PI)",
      "Wodtke, C. (PI)",
      "Yang, D. (PI)",
      "Haghighi, N. (TA)"
    ]
  },
  {
    "id": "CS 802",
    "title": "TGR Dissertation",
    "description": "Terminal Graduate Registration (TGR). CS PhD students who have their TGR form approved should register under the section number associated with their faculty advisor.",
    "terms": [
      "Aut",
      "Win",
      "Spr",
      "Sum"
    ],
    "units": "0",
    "instructors": [
      "Achour, S. (PI)",
      "Agrawala, M. (PI)",
      "Aiken, A. (PI)",
      "Akbarpour, M. (PI)",
      "Altman, R. (PI)",
      "Anari, N. (PI)",
      "Barrett, C. (PI)",
      "Bejerano, G. (PI)",
      "Bernstein, M. (PI)",
      "Boahen, K. (PI)",
      "Bohg, J. (PI)",
      "Boneh, D. (PI)",
      "Bouland, A. (PI)",
      "Boyd, S. (PI)",
      "Brunskill, E. (PI)",
      "Charikar, M. (PI)",
      "Choi, Y. (PI)",
      "Dror, R. (PI)",
      "Durumeric, Z. (PI)",
      "Engler, D. (PI)",
      "Ermon, S. (PI)",
      "Fan, J. (PI)",
      "Fatahalian, K. (PI)",
      "Fedkiw, R. (PI)",
      "Finn, C. (PI)",
      "Follmer, S. (PI)",
      "Fox, E. (PI)",
      "Fox, J. (PI)",
      "Ganguli, S. (PI)",
      "Genesereth, M. (PI)",
      "Goel, A. (PI)",
      "Goodman, N. (PI)",
      "Guestrin, C. (PI)",
      "Guibas, L. (PI)",
      "Haber, N. (PI)",
      "Hanrahan, P. (PI)",
      "Hashimoto, T. (PI)",
      "Hayden, P. (PI)",
      "Hennessy, J. (PI)",
      "Horowitz, M. (PI)",
      "Icard, T. (PI)",
      "James, D. (PI)",
      "Johari, R. (PI)",
      "Jurafsky, D. (PI)",
      "Kennedy, M. (PI)",
      "Khatib, O. (PI)",
      "Kjoelstad, F. (PI)",
      "Kochenderfer, M. (PI)",
      "Koyejo, S. (PI)",
      "Kozyrakis, C. (PI)",
      "Kundaje, A. (PI)",
      "Lam, M. (PI)",
      "Landay, J. (PI)",
      "Leskovec, J. (PI)",
      "Levis, P. (PI)",
      "Levitt, M. (PI)",
      "Li, F. (PI)",
      "Liang, P. (PI)",
      "Linderman, S. (PI)",
      "Liu, K. (PI)",
      "Ma, T. (PI)",
      "Manning, C. (PI)",
      "Mazieres, D. (PI)",
      "McClelland, J. (PI)",
      "McKeown, N. (PI)",
      "Mitchell, J. (PI)",
      "Mitra, S. (PI)",
      "Montgomery, S. (PI)",
      "Musen, M. (PI)",
      "Okamura, A. (PI)",
      "Olukotun, O. (PI)",
      "Ousterhout, J. (PI)",
      "Pavone, M. (PI)",
      "Pea, R. (PI)",
      "Potts, C. (PI)",
      "Prabhakar, B. (PI)",
      "Raina, P. (PI)",
      "Re, C. (PI)",
      "Reingold, O. (PI)",
      "Rosenblum, M. (PI)",
      "Rubinstein, A. (PI)",
      "Sadigh, D. (PI)",
      "Sahami, M. (PI)",
      "Salisbury, J. (PI)",
      "Schmidt, L. (PI)",
      "Sidford, A. (PI)",
      "Song, S. (PI)",
      "Subramonyam, H. (PI)",
      "Tan, L. (PI)",
      "Tobagi, F. (PI)",
      "Trippel, C. (PI)",
      "Utterback, C. (PI)",
      "Valiant, G. (PI)",
      "Van Roy, B. (PI)",
      "Vitercik, E. (PI)",
      "Wang, G. (PI)",
      "Wetzstein, G. (PI)",
      "Widom, J. (PI)",
      "Winstein, K. (PI)",
      "Wootters, M. (PI)",
      "Wu, J. (PI)",
      "Yamins, D. (PI)",
      "Yang, D. (PI)",
      "Yeung, S. (PI)",
      "Zhandry, M. (PI)",
      "Zou, J. (PI)"
    ]
  }
]